[
    {
        "detail_id": 1,
        "course_id": "1232",
        "syllabus": "Podnikatelský plán \nZahájení podnikání FO – povinnosti OSVČ vůči ŽÚ, FÚ, institucím sociálního a zdr. pojištění \nEvidence majetku a závazků , založení  a nastavení úč. jednotky na PC / úč. program POHODA/\nFO – zaměstnavatel – personální práce, pracovní smlouvy, přihlášky k soc. a zdr. pojištění, registrace k daním na FÚ, zákonné pojištění odpovědnosti zaměstnavatele za škodu \nRealizace dod. – odb. vztahů, fakturace, vedení evidence na PC\nVedení DE, evidence DPH, příprava podkladů a zpracování přiznání k DPH Zpracování mezd /vč. všech povinností zaměstnavatele/\nAutomobil v podnikání, evidence, výpočet daně a sestavení daň. přiznání k silniční dani\nSpolupráce v rámci EU, zpracování přiznání k DPH, souhrnného hlášení\nVyúčtování zálohové a srážkové daně ze ZČ\nRoční zúčtování příjmů ze závislé činnosti\nPříprava podkladů pro zpracování daňového přiznání FO, rozdíly FO zapsané v OR \nSestavení daňového přiznání FO, přehledů příjmů a výdajů OSVČ pro OSSZ  a zdr. pojišťovnu",
        "literature": "Zákon č. 455/1991 Sb., o živnostenském podnikání\nZákon č. 586/1992 Sb., o daních z příjmů\nZákon č. 235/2004 Sb., o dani z přidané hodnoty\nZákon č. 16/1993 Sb., o silniční dani, \nZákon č. 262/2006 Sb., zákoník práce",
        "annotation": "Cílem předmětu je využití teoretických znalostí při podnikání fyzické osoby. Studenti si sami sestaví podnikatelský plán, založí firmu a budou vzájemně mezi sebou obchodovat. Na základě účetních dokladů se naučí vést daňovou evidenci na PC, zpracovávat mzdy, vyhotovovat povinné formuláře a sestavovat veškerá daňová přiznání. Důraz bude kladen na to, aby si studenti uvědomili dílčí kroky, které je čekají při podnikání a provázanost těchto činnosti. \n \nZnalosti: Student umí definovat veškeré činnosti podnikatele ve vzájemných souvislostech, zná povinnosti podnikatele ve vztahu ke státní správě.\nDovednosti: Student umí vystavit a zpracovat veškeré účetní doklady vtuzemsku i v rámci EU, samostatně vede daňovou evidenci na PC v účetním softwaru, umí zpracovat mzdy, sestavuje daňová přiznání, souhrnné hlášení a přehledy pro sociální správu a pro zdravotní pojišťovny. \nObecné způsobilosti: Student umí zpracovat veškeré účetní případy při podnikání, umí pracovat s legislativními změnami, chápe podnikatele a jeho činnosti ve vzájemných souvislostech .",
        "guarantor": "Ing. Dagmar Frendlovská, Ph.D.",
        "credits": 2
    },
    {
        "detail_id": 2,
        "course_id": "1571",
        "syllabus": "Úvod do informační bezpečnosti, legislativa a normy.\nKryptografie.\nProudové šifry, blokové šifry.\nHashovací funkce a datová integrita.\nSymetrické šifrování. Asymetrické šifrovaní, výměna klíčů.\nDigitální podpisy, identifikace a autentizace entity.\nCertifikáty a certifikační autority. Komerční/kvalifikované certifikáty, časová razítka.\nViry – historie a současnost. Antivirové programy.\nChyby v programech, revize kódu, testování bezpečnosti.",
        "literature": "MENEZES, A. J., Oorschot, P. C., VANSTONE, S. A. Handbook of Applied Cryptography. 1. vyd. Boca Raton: CRC Press, 1996. ISBN: 08-493-8523-7.\nSINGH, Simon. Kniha kódů a šifer: tajná komunikace od starého Egypta po kvantovou kryptografii. Praha: Dokořán, 2003, 382 s. ISBN 80-7203-499-5.\nPŘIBYL, J., KODL, J. Ochrana dat v informatice. 1. vyd. Praha: Vydavatelství ČVUT, 1996. 299 s. ISBN 80-01-01664-1.\nCALDER, A., WATKINS, S. Governance: A Manager's Guide to Data Security and ISO 27001 / ISO 27002. 1. vyd. Cambridge: Kogan Page Ltd, 2008. ISBN 0-7494-5271-4.\nMATYÁŠ, V., KRHOVJÁK J. Autorizace elektronických transakcí a autentizace dat i uživatelů. 1. vyd. Brno: Masarykova univerzita, 2008. ISBN 978-80-210-4556-9.\nSCHNEIER, B. Applied cryptography, second edition :protocols, algorithms, and source code in C. 1. vyd. New York: John Wiley & Sons, 1996. ISBN 0-471-11709-9.\nHORÁK, J. Bezpečnost malých počítačových sítí. 1. vyd. Praha: Grada Publishing, 2003, ISBN 80-247-0663-6.\nSTALLINGS, W. Cryptography and Network Security: Principles and Practice, 7. vydání.  ISBN-13: 978-0134444284 \nKOLOUCH, J. CyberCrime. 1. vydání,CZ.NIC, Praha 2016. ISBN 978-80-88168-18-8",
        "annotation": "Předmět se věnuje principům a aplikacím kryptografie v oblasti informační bezpečnosti. Předmět obeznamuje se základními principy kryptografie a uvádí v současnosti používané kryptografické systémy a jejich aplikace. Zmíněna je také problematika legislativy a norem v kryptografii. Další část předmětu je věnována kryptografickým protokolům, zabezpečení počítačových sítí. V závěru jsou zmíněny moderní trendy v kryptografii.\nDovednosti: Student je schopen navrhnout politiku informační bezpečnosti, je schopen bezpečně ukládat informace, komunikovat pomocí zabezpečených protokolů, používat antivirové programy.\nObecné způsobilosti: Student se orientuje v problematice šifrování a bezpečnosti dat. Chápe význam ochrany informačního soukromí a zná zásady bezpečného chování na internetu. Student zná časté chyby v programovém kódu a ví, jak se těchto chyb vyvarovat.",
        "guarantor": "Mgr. Antonín Přibyl ",
        "credits": 4
    },
    {
        "detail_id": 3,
        "course_id": "1582",
        "syllabus": "Co je GPS, instalace Mapsource, základní nastavení GPS přístroje body, prošlé trasy \nNahrání dat z GPS do programu Mapsource a práce s nimi, orientace pomocí GPS, nalezení bodů, nahrání trasy, práce s cestou pomocí počítače, zobrazení cesty v programu Google Earth a dalších programech\nGIS - úvod do problematiky, informace a prostor, využití GIS, technické aspekty GIS\nModelování geografického prostoru, geografické souřadné systémy\nModelování geo-objektů\nModelování pomocí rastrových map, vrstev. Databázová podpora GIS\nGIS - Vytvoření a tisk map, šablona, přidání elementů, mapová šablona pro více map\nGIS - Přidání reportu do projektu, grafy, export a import dat, export do souboru\nGIS - Vytvoření nové osobní geodatabáze, propojení tabulek\nGIS - Import prostorových a atributových dat, světová projekce, vytvoření shapefile\nGeokódování, prostorová analýza, zpracování prostorových dat, řešení praktických úloh v GIS\nGIS Server – přehled: web jako platforma GIS, komponenty ArcGIS Serveru, typy GIS služeb, vytváření GIS zdrojů, vhodné způsoby publikování GIS zdrojů, složky ArcGIS Serveru\nNávrh mapových služeb: výběr vhodného typu vrstvy z hlediska způsobu vykreslování (služby využívající cache, dynamicky vykreslované služby, image služby, grafické vrstvy), pracovní vrstvy a vrstvy podkladové mapy, aspekty návrhu služeb z hlediska optimalizace výkonu, publikování mapové služby\nPoskytování dat prostřednictvím internetu: výběr webové aplikace a vývojového prostředí (API), implementace serverového řešení",
        "literature": "RAPANT, P. Geoinformatika a geoinformační technologie. 1. vyd. Ostrava: VŠB-TU, 2006. 463 str. ISBN 80-248-1264-9.\nGORR, W. L., KURLAND, K. S. GIS Tutorial: workbook for ArcView 9 ; updated for ArcGIS 9.2: teorie pro praxi. 2. vyd. Second Edition. Redlands: ESRI Press, 2007. 354 s. ISBN 978-1-58948-178-7.\nHOJGR, R., STANKOVIČ, J. GPS praktická uživatelská příručka. 1. vyd. Brno: Cpress, 2007. ISBN 978-80-251-1734-7.\nARCDATA. ArcGIS Deskopt [online] 2011 [Citace: 16. říjen 2011.] Dostupné z http://www.arcdata.cz/produkty-a-sluzby/software/esri/arcgis-desktop/.",
        "annotation": "Cílem předmětu je seznámit studenta se základní teorií a praktickým využitím geografických a navigačních systémů a vytvářením dat pro ně. Dalším cílem je pochopení principů modelování geografického prostoru, práce s geografickými souřadnými systémy, prostorová analýza, návrh mapových služeb a poskytování dat prostřednictvím Internetu.\nZnalosti: Student umí získávat data pomocí GPS. Zná problematiku modelování geografického prostoru a geografických souřadných systémů. Mezi další důležité znalosti patří vytvoření a tisk map, import prostorových a atributových dat, prostorová analýza, návrh mapových služeb a poskytování dat prostřednictvím Internetu.\nDovednosti: Student umí pracovat s GIS  aplikacemi. Umí získávat a vkládat data do GIS aplikací. Dovede provádět prostorové analýzy a poskytovat GIS data prostřednictvím Internetu.\nObecné způsobilosti:  Student se orientuje v současných trendech GIS a umí použít případně modifikovat, nebo vyvinout správné nástroje pro analýzu, zobrazení a publikování geodat.",
        "guarantor": "PaedDr. František Smrčka, Ph.D. ",
        "credits": 4
    },
    {
        "detail_id": 4,
        "course_id": "1587",
        "syllabus": "Lossless and lossy compression algorithms\nBasics of computer graphics (vector, bitmap graphics, 3D)\n\nSignal representation in time and frequency domain\nDigital photography – recording, processing, formats, compression\nDigital audio – recording, processing, formats, compression\nDigital video – recording, processing, formats, compression\nStreaming audio and video\nFlash",
        "literature": "SINCLAIR, I. aj. Audio Engineering: Know It All. Newnes, 2009, ISBN 978-1-85617-526-5.\nBOVIK, A. Handbook of Image and Video Processing. 2nd ed. Burligton: Elsevier Academic Press, 2005. 1372 s. ISBN 01-211-9792-1.\nBROWNE, Steven E. High definition postproduction: editing and delivering HD video. 2nd ed. Editor Al Bovik. Boston: Elsevier Focal Press, 2007, 230 p. ISBN 02-408-0839-8.",
        "annotation": "The course deals with the fundamentals of ackquisition and processing of multimedia signals, in particular, with respect to the design of web and multimedia presentations.\nKnowledge: a student knows the principles of acquisition and processing of audio and vidoe signal and graphical objects. A student knows the methods of lossy and lossless compression, especially with respect to multimedia signals.Skills: A student is able to use the relevant means for acquisition, recording, processing, compression and publishing of graphics, audio and video signals.",
        "guarantor": "doc. Ing. Zbyněk Bureš, Ph.D. ",
        "credits": 4
    },
    {
        "detail_id": 5,
        "course_id": "1589",
        "syllabus": "Základy zvukové a obrazové techniky.\nZáklady fyziologie a psychologie slyšení a vidění.\nFormáty zvukového a obrazového signálu, komprese a dekomprese.\nÚvod do akustiky, elektroakustické měniče, snímání a reprodukce akustického signálu, ozvučování.\nVstup a výstup zvukového signálu, zvukové karty.\nZpracování zvukového signálu (analýza, korekce, efekty, střih, mixáž, produkce).\nÚvod do optiky, obrazové senzory a displeje, snímání a reprodukce obrazového signálu.\nVstup a výstup obrazového signálu, grafické karty.\nZpracování obrazového signálu (analýza, korekce, efekty a animace, střih, produkce).\nProdukce a publikování audiovizuálního díla.",
        "literature": "ŠKVOR, Z. Elektroakustika a akustika. Praha: ČVUT, 2012, ISBN 9788001050347.\nSINCLAIR, I. aj. Audio Engineering: Know It All. Newnes, 2009, ISBN 978-1-85617-526-5.\nBOVIK, A. Handbook of Image and Video Processing. 2nd ed. Burligton: Elsevier Academic Press, 2005. 1372 s. ISBN 01-211-9792-1.\nSYROVÝ, Václav. Hudební akustika. 1. vyd. Praha: Akademie múzických umění, 2003, 427 s. ISBN 80-733-1901-2.\nBROWNE, Steven E. High definition postproduction: editing and delivering HD video. 2nd ed. Editor Al Bovik. Boston: Elsevier Focal Press, 2007, 230 p. ISBN 02-408-0839-8.",
        "annotation": "Předmět probírá teoretické i praktické aspekty záznamu a zpracování multimediálních signálů. Podává přehled o dostupných technologiích pro záznam, zpracování a reprodukci audio a video signálu.\nZnalosti: Student zná principy a má přehled o akustických měničích, snímačích obrazu, zdrojích zvuku a obrazu. Zná základní teorii záznamu a zpracování zvukového a obrazového signálu.\nDovednosti: Student umí používat odpovídající prostředky pro záznam audio a video signálu. Umí provést analýzu a zpracování takového signálu, zejména frekvenční analýzu a korekci, mixáž, střih, kompresi a optimalizaci pro různé oblasti použití.",
        "guarantor": "doc. Ing. Zbyněk Bureš, Ph.D. ",
        "credits": 4
    },
    {
        "detail_id": 6,
        "course_id": "1592",
        "syllabus": "Seznámení se s podnikem a jeho základními organizačními normami\n Studium problematiky pro řešení úkolů Odborné praxe\n Zaškolení se do použitých technologií a nástrojů\n Realizace odborných činností, na které je Odborná praxe zaměřena",
        "literature": "",
        "annotation": "Hlavním cílem odborné praxe je naučit studenta uplatnit se prakticky v pracovním procesu. Znamená to umět zejména:\n\nuplatnit teoretické znalosti, vědomosti a dovednosti při řešení reálných pracovních úkolů,\nanalyzovat zjištěné skutečnosti, konfrontovat teorii s jejím praktickým použitím,\nvyvodit a zpracovat vlastní závěry z provedené analýzy,\nnavrhnout opatření k řešení zjištěných problémů,\nvyužít získané praktické zkušenosti při zpracování bakalářské práce.",
        "guarantor": "Ing. Jan Jirsa",
        "credits": 22
    },
    {
        "detail_id": 7,
        "course_id": "1600",
        "syllabus": "Přehled programovacích jazyků, programovací paradigmata\nStruktura překladače, virtuální stroj\nKonečné automaty a jejich programová realizace \nNávrh a realizace lexikálního analyzátoru \nBezkontextové gramatiky a zásobníkové automaty \nLL(1) gramatiky \nRealizace syntaktické analýzy rekurzívním sestupem \nPřekladové gramatiky a automaty \nL-atributové překladové gramatiky \nPřekladač specifikovaný L-atributovou překladovou gramatikou \nSpecifikace a implementace datových typů \nSpecifikace a implementace podprogramů \nSpecifikace a implementace datových abstrakcí \nGenerování strojového kódu",
        "literature": "BENEŠ, M. Překladače. Vzniklo na FEI VŠB-TU Ostrava a FE VUT Brno, pro výukové účely na VŠPJ využíváno s osobním svolením autora.\nMOGENSEN, T. AE. Basics of Compiler Design Anniversary edition. 3. vyd. University of Copenhagen: lulu.com, 2010, 307 s. ISBN 978-87-993154-0-6.\nMÜLLER, K. Programovací jazyky. 1. vyd. Praha: ČVUT, 2005, 219 s. ISBN 80-01-02458-X.\nNEŠVERA, Š. Programovací jazyky. Cvičení. 1. vyd. Praha: ČVUT, 2005, 114 s. ISBN 80-01-02522-5.\nAHO, A. V., LAM, M. S., SETHI, R., ULLMAN, J. D. Compilers: Principles, Techniques, and Tools. 2. vyd. Cloth: Prentice Hall, 2006, 1000 s. ISBN 03 21-48681-1.",
        "annotation": "Předmět obsahuje přehled obecných rysů programovacích jazyků a výklad základních metod jejich implementace. Návrh a programová realizace jednotlivých částí překladače jsou podloženy základní teorií gramatik a automatů. Pro ilustraci metod je zaveden jednoduchý programovací jazyk a navržen a realizován jeho překladač. Dále jsou probrány základní metody implementace datových typů, podprogramů a datových abstrakcí.\nZnalosti: Student ovládá základy teorie formálních jazyků a dovede rozlišit mezi různými způsoby jejich formální reprezentace. Pracuje plynně s regulárními výrazy a gramatikami, konečnými a zásobníkovými automaty a bezkontextovými gramatikami. V jejich rámci je schopen realizovat základní způsoby vzájemných konverzí a kanonizací.\nDovednosti: Student je za použití standardních vývojových nástrojů schopen naprogramovat lexikální i syntaktický analyzátor, zahrnout do gramatik sémantická pravidla a generovat výstupní kód v souladu s cílovou specifikací.\nObecné způsobilosti: Student umí účinně formalizovat a následně automatizovat standardní typy interakcí s výpočetní technikou. Své výstupy je schopen dovést do podoby cílově orientovaného překladače nebo obecně interpretovatelného jazyka. Kromě programovacích nebo skriptovacích jazyků, rozšiřujících možnosti libovolných SW produktů, může tímto způsobem automatizovat také procesy vývoje SW, např. formální modelování uživatelských požadavků nebo automatickou verifikaci a testování vyvíjených programových modulů.",
        "guarantor": "doc. Dr. Ing. Jan Voráček, CSc. ",
        "credits": 5
    },
    {
        "detail_id": 8,
        "course_id": "1603",
        "syllabus": "Úvod do technologií zařazených do .NET, .NET Framework a jeho verze\nVyužití Visual Studia a jeho utilit pro návrh grafického rozhraní uživatelské aplikace a pro vývoj aplikace\nJazyk C# - charakteristické rysy a rozšíření jazyka, principy objektově orientované programování v .NET/C#\nCTS (typový systém), třída, prvky třídy, metody a parametry metod\nDelegát, obsluha události, rozhraní (interface) a jeho implementace\nUživatelské rozhraní a tvorba GUI aplikací: WinForms, Windows Presentation Foundation (WPF)\nPrincipy a zásady tvorby aplikace s grafickým uživatelským rozhraním.\nFormulářové komponenty, dialogy a jejich obsluh, obsluha události, registrace obslužné metody události\nVrstvy aplikace (prezentační, datová, logická)\nMechanismus výjimek (Exception), obsluha chyb, mechanismus výjimek k předávání zpráv mezi vrstvami\nTestování a ladění aplikace\nSouborový systém. Práce se soubory a adresáři, souborové operace.\nXML a jeho využití při exportu a importu dat.\nZpracování zpráv klávesnice a myši.\nSystém a konfigurace: tisk v prostředí MS Windows, práce se schránkou (clipboard), podpora drag&drop, prostředí operačního systému, národní prostředí a jazyková mutace, práce s registrační databází.\nZabezpečení, přístupová oprávnění.\nDistribuční jednotky, assembly, knihovny, verzování\nAplikace s podporou vícevláknového programování, procesy a vlákna\nDatabáze: Přístup k datům a zobrazení dat v aplikaci (ADO, Ling, Sql).\nSíťové programování\nNávrhové vzory. Základní kategorizace a využití návrhových vzorů při tvorbě aplikací.\nGrafika a kreslení.\nDalší praktické možnosti .NET: skenování, generování pdf, OCR, mluvené slovo, ....",
        "literature": "Studijní opora v LMS Moodle (povinná)\nVIRIUS, M. \tC# Hotová řešení, Computer Press, Brno, 2006, ISBN 80-251-1084-2 (povinná)\nPETZOLD, Charles \tProgramování Microsoft Windows Forms v jazyce C#. vyd. 1. Překlad Karel Voráček. Brno: Computer Press, 2006, 356 s. ISBN 80-251-1058-3. \t (povinná)\nMAREŠ, Amadeo. 1001 tipů a triků pro C# 2010. Brno: Computer Press, 2011. ISBN 978-80-251-3250-0. (doporučená)\nVIRIUS, Miroslav. C# 2010: hotová řešení. Brno: Computer Press, 2012. K okamžitému použití (Computer Press). ISBN 978-80-251-3730-7. (doporučená)\nNASH, T. \tC# 2010: Rychlý průvodce novinkami a nejlepšími postupy. 1. vyd. Brno: Computer Press, 2010, 624 s. ISBN 978-80-251-3034-6. (doporučená)\nHEROUT, Pavel \tJava a XML. České Budějovice: Kopp, 2007. ISBN 978-80-7232-307-4. (doporučená)\nHEROUT, Pavel \tJava: grafické uživatelské prostředí a čeština. 2. vyd. České Budějovice: Kopp, 2007. ISBN 8072323288. (doporučená)\nHEROUT, Pavel \tTestování pro programátory. České Budějovice: Kopp, 2016. ISBN 978-80-7232-481-1. (doporučená)",
        "annotation": "Absolvováním předmětu získají studenti přehled o technologii .NET a naučí se uplatňovat postupy a techniky při tvorbě desktopových aplikací v prostředí MS Windows. Znalosti: Student umí popsat a používat technologie .NET, zná zásady tvorby a postupy využívané při tvorbě desktopových aplikací s GUI, zná principy událostmi řízeného programování. Student má znalost o dostupných nástrojích technologie .NET. Dovednosti: Student umí aplikovat zásady tvorby software a efektivně využívat vhodné nástroje a postupy při realizaci robustních aplikací s grafickým uživatelským rozhraním běžící v prostředí MS Windows. Je schopen používat základní třídy WinForm a Windows Presentation Foundation a uplatnit ADO, Linq při přístupu k datům.",
        "guarantor": "Ing. Marek Musil",
        "credits": 4
    },
    {
        "detail_id": 9,
        "course_id": "1604",
        "syllabus": "Úvod do vývoje a specifik mobilních platforem\nVývojová prostředí a programovací jazyky.\nZáklady uživatelského rozhraní pro mobilní zařízení\nVývoj, distribuce a aktualizace aplikací. \nPlatforma Android - koncepty programování, architektura a SDK platformy, příklady aplikací\nPlatforma iOS - koncepty programování, architektura a SDK platformy, příklady aplikací\n\nPlatforma Windows Phone 7 - koncepty programování, architektura a SDK platformy, příklady aplikací\nProgramování pro chytrá zařízení - wearables. \nSrovnání platforem\nProjekt",
        "literature": "ALLEN, Grant. Android 4: průvodce programováním mobilních aplikací. Brno: Computer Press, 2013. ISBN 978-80-251-3782-6. (povinná)\nMEIER, R. Professional Android 2 application development. Indianapolis: Wiley, 2010, 543 s. ISBN 978-0-470-56552-0. (povinná)\nVÁVRŮ, Jiří a Miroslav UJBÁNYAI. Programujeme pro Android. 2., rozš. vyd. Praha: Grada, 2013. Průvodce (Grada). ISBN 978-80-247-4863-4. (povinná)\nROY, Uttam K. \tAdvanced Java Programming. 1. vyd. India: Oxford Unviersity Press, 2015, ISBN 978-0-19-945550-8. (doporučená)\nCONWAY, J. HILLEGASS, A. IPhone programming: the Big Nerd Ranch guide. Indianapolis, IN: Distributed by Pearson Technology Group, 2010, 396 p. ISBN 03-217-0624-2. (doporučená)\nRANDOLPH, N. Professional Windows Phone 7 application development. Wrox, 2010. ISBN 978-0470891667.\nDIMARZIO, J. F. Programujeme hry pro Android 4. Brno: Computer Press, 2012. ISBN 978-80-251-3754-3.\nSHIRAZI, Jack. Java - vylaďování výkonu: [účinné a efektivní strategie vylaďování]. Praha: Grada, 2003. ISBN 80-247-0752-7.",
        "annotation": "V rámci předmětu se studenti seznámí se základní sadou vývojových nástrojů pro majoritně používané mobilní platformy. Nejprve budou nastíněny koncepty a specifika mobilních platforem jako takových. Následně pak bude stručně představena architektura a principy vývoje platforem Apple iOS (iPhone/iPad), Microsoft Windows Phone 7 a Google Android. V rámci předmětu budou studenti vyvíjet vlastní mobilní aplikaci pro vybrané prostředí.",
        "guarantor": "Ing. Marek Musil",
        "credits": 4
    },
    {
        "detail_id": 10,
        "course_id": "1611",
        "syllabus": "Rozdíl mezi seminární a bakalářskou prací\nMetodologické požadavky na bakalářskou práci, orientace jak stanovit přesné, konkrétní cíle a úkoly bakalářské práce\nStanovení hlavních cílů bakalářské práce a volba metod jejího zpracování\nPráce se základními zdroji informací, shromažďování dat a orientace ve zvolené problematice\nBibliografické citace jako souhrn údajů o citované publikaci nebo její části umožňující její identifikaci, odkazy na citace \nVnější úprava diplomové práce a její jednotná grafická úprava, základní typografická pravidla\nPříprava na obhajobu a zásady její prezentace\nIndividuální příprava bakalářské práce, konzultace",
        "literature": "BORŮVKOVÁ J. a kol., Jak napsat bakalářskou práci. Studijní text VŠPJ, Jihlava 2007\nBORŮVKOVÁ J., Formální úprava bakalářské práce. Studijní text VŠPJ, Jihlava 2009\nNová citační norma ČSN ISO 690:2011: Bibliografické citace [online]. [cit. 2017-06-15]. Dostupné z: https://sites.google.com/site/novaiso690/metody-citovani\nBORŮVKOVÁ, J., S. DVOŘÁKOVÁ a H. VOJÁČKOVÁ. Jak psát práce na VŠPJ: Typografická pravidla pro studenty VŠPJ. Studijní test VŠPJ. Jihlava, 2021.",
        "annotation": "Cílem Semináře k bakalářské práci je seznámit studenty s formálními požadavky na tvorbu bakalářské práce a postupy a metodami jejího vypracovávání. Součástí předmětu je procvičování prezentačních dovedností a kultivace ústního i písemného projevu na úrovni bakaláře. Navržená studijní zátěž předpokládá kromě řešení úloh předmětu rovněž vypracovávání vlastní bakalářské práce.\nZnalosti: Student zná formální náležitosti tvorby závěrečné práce, orientuje se v etice publikační činnosti zejména ve vztahu k citacím a plagiátorství. Student zná typickou strukturu odborného textu, směřujícího od zadání problému a rešerše přes řešení problému až k prezentaci výsledků, diskusi a závěrečnému souhrnu.\nDovednosti: Student umí využít získaných teoretických znalostí při vypracovávání své bakalářské práce, umí korektně citovat zdroje, umí napsat srozumitelný smysluplný dobře strukturovaný odborný text na dané téma s využitím vlastních originálních výsledků. Student umí své výsledky srozumitelně prezentovat v plénu.",
        "guarantor": "Mgr. Zdeňka Dostálová ",
        "credits": 6
    },
    {
        "detail_id": 11,
        "course_id": "1612",
        "syllabus": "Computer Storage - architektury, protokoly, rozhraní\nProtokoly diskových polí - FC, iSCSI, SAS\nZálohovací zařízení\nZálohování, obnova a archivace dat\nKlonování stanic a serverů\nVzdálená správa stanic – RDP, VNC, Teamviewer\nHromadná instalace  a správa stanic\nSpráva uživatelských oprávnění – group policy editor\nSpráva dokumentů – systémy CMS, DMS\nSpráva a zabezpečení databází",
        "literature": "RUEST, D., RUEST, N. Virtualizace: podrobný průvodce. 1. vyd. Brno: Computer Press, 2010, 408 s. ISBN 978-80-251-2676-9.\nLACKO, L. Mistrovství v SQL Server 2012. 1. vyd. Brno: Computer Press, 2012. ISBN 978-80-251-3773-4.\nSTANEK, W. R. Mistrovství v Microsoft Windows Server 2008. 1. vyd. Brno: Computer Press, 2009, 1364 s. ISBN 978-80-251-2158-0.\nWALTERS, R. aj. Mistrovství v Microsoft SQL Server 2008: [kompletní průvodce databázového experta]. 1. vyd. Brno: Computer Press, 2009, 864 s. ISBN 978-80-251-2329-4.\nTulloch, M. Introducing Windows Server 2012 R2 Technical Overview. Redmond, Microsoft Press 2013. ISBN: 978-0-7356-8278-8 Online: http://download.microsoft.com/download/4/8/A/48A3ADA5-063D-4C7F-AA11-F9A3AE8C8B55/Microsoft_Press_ebook_Introducing_Windows_Server_2012_R2_PDF.pdf\nHOK, A. Kouzla s pevným diskem v programech True Image a Disk Director. 1. vyd. Brno: Computer Press, 2006, 247 s. ISBN 80-251-1040-0.\nKUNSTOVÁ, R. Efektivní správa dokumentů. Praha: Grada, 2010. ISBN: 978-80-247-3257-2.",
        "annotation": "Předmět se věnuje vysvětlení jednotlivých typů zálohování, zálohovací technologií i rozhraní. Dále jsou probírány možnosti vzdálené instalace a administrace stanic, správa a zabezpečení databází i správa dokumentů.\nDovednosti: Student je schopen pomocí automatizovaných nástrojů instalovat i spravovat vetší počet stanic. Student umí využívat systémy DMS i CMS, je schopen zabezpečit přístup do databází. Student je schopen konfigurovat disková pole a nastavit zálohování serverů i stanic.\nObecné způsobilosti: Student se orientuje v problematice zálohování dat, je schopen navrhnout způsob zálohování pro konkrétní situace. Student umí pracovat s nástroji pro vzdálenou správu stanic, orientuje se ve správě databází i nástrojích pro správu dokumentů.",
        "guarantor": "Mgr. Antonín Přibyl ",
        "credits": 4
    },
    {
        "detail_id": 12,
        "course_id": "1613",
        "syllabus": "Definice softwarového inženýrství a historie jeho vzniku.\nSoftwarový proces a jeho plánování.\nModelování podnikových (byznys) procesů a požadavků.\nAnalýza problémové domény - analytické třídy, atributy, stavy, relace. \nArchitektura softwarových systémů.\nNávrh - návrhové třídy a vzory, rozhraní a komponenty. \nTestování.\nIntegritní omezení a jazyk OCL.\nMetodiky tvorby programových systémů.",
        "literature": "Fowler, M.: Destilované UML. Grada, 2009.\nArlow, J. - Neustadtová, I.: UML 2 a unifikovaný proces vývoje aplikací UP. Computer Press, 2007.\nKadlec, V.: Agilní programování. Computer Press Praha, 2004\nPatton, R.: Testování softwaru. Computer Press, Brno, 2002\nSommerville, I.: Software Engineering ( 9th ed. ), Addison Wesley, Reading, Mass. 2011. \nRichta, V., Sochor, J.:Softwarové inženýrství, FEL, ČVUT, 1995",
        "annotation": "Studenti by se v rámci předmětu měli seznámit s inženýrskými postupy analýzy a návrhu softwaru. Především bude kladen důraz na tvorbu softwaru, jehož rozsah vyžaduje spolupráci v týmu. Uvedené postupy budou probrány nejen po teoretické stránce, ale studenti budou mít také možnost si je prakticky na cvičeních vyzkoušet. Pro realizaci projektů budou krom jiného používány modelovací jazyky UML a BPMN, CASE nástroje, nástroje pro projektové řízení a plánování zdrojů, nástroje pro týmovou komunikaci, a také nástroje pro správu a verzování dokumentů. Studenti se také seznámí s problematikou objektově orientované analýzy a  návrhu, postupem stanovení architektury, a základy metod validace, verifikace a testování softwaru.",
        "guarantor": "doc. Ing. Karel Richta, CSc.",
        "credits": 5
    },
    {
        "detail_id": 13,
        "course_id": "1636",
        "syllabus": "Typy signálů a jejich charakteristiky.\nSpojité periodické signály, jejich vlastnosti a analýza.\nStochastické signály, spektrum, spektrální hustota a vztah ke korelační funkci.\nAnalýza spojitých aperiodických signálů.\nPrůchod signálu nelineárními soustavami, modulace\nIdeální vzorkování a interpolace, diskrétní periodické a aperiodické signály, jejich vlastnosti a analýza.\nSpektrální reprezentace diskrétních signálů\nDFT a FFT algoritmy, interpretace spekter\nČíslicová filtrace z hlediska zpracování signálů\nMetody syntézy signálů\nImplementace obrazových dat, obraz jako dvourozměrný signál, rozdělení metod pro zpracování obrazu\nGeometrické, jasové a integrální transformace obrazu\nFiltrace šumu, detekce hran",
        "literature": "Jan J.: \tČíslicová filtrace, analýza a restaurace signálů, 2. upravené vydání, Vutium, Brno, 2002.\nZaplatílek K., Doňar B.: \tMatlab - začínáme se signály, BEN, Praha, 2006\nZaplatílek K., Doňar B.: \tMatlab – pro začátečníky, BEN, Praha, 2009\nSmith SW.: \tThe Scientist and Engineer’s Guide to Digital Signal Processing, Second Edition, California Technical Publishing, San Diego, 1999",
        "annotation": "Předmět představuje základní teorii pro popis, analýzu a zpracování signálů ve spojitém i diskrétním čase. Věnuje se rovněž praktickým algoritmům pro analýzu a syntézu signálů. V části věnované zpracování obrazu se jednak probírají matematické metody zpracování obrazů, jednak praktické postupy zpracování obrazu pro účely kontroly kvality v průmyslové praxi. Znalosti: Student zná teorii pro popis, analýzu a zpracování signálů, a to jak ve spojitém, tak v diskrétním čase a ve frekvenční doméně. Zná teoretické a praktické aspekty vzorkování a interpolace, základní algoritmy pro analýzu a zpracování signálů (DFT, FFT…) a základní metody syntézy signálů. Uvědomuje si význam a princip číslicové filtrace. Je mu znám pojem spektrální hustoty šumu. Zná základní metody pro zpracování dvourozměrných signálů (obrazů) po teoretické stránce, má představu o praktické podobě zpracování obrazu ve specifickém software. Dovednosti: Student umí aplikovat teoretické znalosti při řešení praktické úlohy. Umí provést základní analýzu, zpracování a syntézu uvažovaných signálů. Umí použít softwarové nástroje k převodu signálů z časové do frekvenční domény, umí interpretovat spektra signálů získaná použitím algoritmu FFT. Dokáže s využitím software implementovat základní metody pro zpracování signálu (detekce hran, eroze, dilatace, horní a dolní propust…) a umí tyto metody použít v konkrétních případech. Umí ve specializovaném SW používaném v průmyslové praxi realizovat základní úlohy kontroly kvality a čtení kódů pro zpětnou sledovatelnost.",
        "guarantor": "Dr. Ing. Vlastimil Vondra",
        "credits": 4
    },
    {
        "detail_id": 14,
        "course_id": "330",
        "syllabus": "Typy operačních systémů, funkce OS\nPřidělování procesoru, přidělování paměti, přidělování periferií\nSystém souborů\nSynchronizace procesů, sdílení souborů\nUnix – správa paměti, systém souborů, komunikace mezi procesy\nUnix – xwindow, síťová architektura, NFS, NIS, SAMBA, e-mail, Apache, FTP, Telnet, databáze, PHP\nWindows 9X – charakteristika systému, OLE, DOS programy, síťová architektura\nWindows XP, 7, 10 – charakteristika a konfigurace systému\nVirtualizace\nLinux - skriptování v BASH\nLinux - konfigurace systému\nWindows - Active directory, group policy\nBezpečnost operačního systému",
        "literature": "SMRČKA, F. Operační systémy [online]. 2012. Dostupné z: http://elearning.vspj.cz\nRUEST, Danielle a Nelson RUEST. Virtualizace: podrobný průvodce. Brno: Computer Press, 2010. ISBN 978-802-5126-769\nPECINOVSKÝ, Josef a Nelson RUEST. 1001 tipů a triků pro Windows 10: podrobný průvodce. Brno: Computer Press, 2016. ISBN 978-802-5146-859.\nHORÁK, Jaroslav. BIOS a Setup: průvodce základním nastavením počítače : [určeno pro Windows 7, Vista a XP]. 3., aktualiz. vyd. Brno: Computer Press, 2010. ISBN 978-802-5130-353\nOficiální stránky firmy Microsoft. [online] 2012 [cit. 2013-02-04]. Dostupné z: http://www.microsoft.com.\nKAMENÍK, Pavel. Příkazový řádek v Linuxu: praktická řešení. Brno: Computer Press, 2011. ISBN 978-802-5128-190.",
        "annotation": "Cílem předmětu je seznámit studenta se základy operačních systémů. Student bude mít přehled o používaných operačních systémech, jejich výhodách a nevýhodách. Měl by umět se rozhodnout o vhodnosti použití konkrétního operačního systému a také by ho měl umět nainstalovat a nakonfigurovat, včetně instalace důležitých služeb. Pro konfiguraci a správu bude schopen použít skriptové soubory shell operačního systému. Také bude znát obecné vlastnosti jádra operačního systému, včetně synchronizace procesů. Student dokáže vybrat vhodný software pro virtualizaci a prakticky ho použít.Znalosti: Student zná rozdělení a základní vlastnosti operačních systémů. Teoreticky zná úkoly jádra operačního systému jako je přidělování procesoru, přidělování paměti, správa souborů, přidělování periferií, synchronizace procesů. Zná požadavky na instalaci a konfiguraci konkrétních operačních systémů jako jsou operační systémy Windows a Linux. Student má přehled o použitelnosti jednotlivých virtualizačních prostředcích. Dovednosti: Student umí nainstalovat konkrétní operační systém, nakonfigurovat a spravovat ho z hlediska procesů, služeb a bezpečnosti. Umí pro správu a nastavení použít skriptové soubory. Umí vybrat a použít vhodný virtualizační software. Dokáže rozdělit pevný disk, vybrat a použít vhodný prostředek pro zálohu a obnovu operačního systému nebo disku.Obecné způsobilosti: Student se orientuje v trendech operačních a virtualizačních systémů. Umí zvolit vhodný operační systém pro praktické nasazení. Dokáže využít novinek ve správě a v bezpečnosti operačních systémů.",
        "guarantor": "PaedDr. František Smrčka, Ph.D. ",
        "credits": 5
    },
    {
        "detail_id": 15,
        "course_id": "335",
        "syllabus": "Grafy elementárních funkcí (lineární, kvadratická, lineárně lomená, exponenciální, logaritmická ...)\nGrafy křivek (kuželosečky)\nÚpravy algebraických výrazů\nSoustavy rovnic, nerovnice\nNerovnice\nGoniometrické rovnice\nGoniometrické vzorce, úpravy výrazů\n\nExponenciální rovnice\nLogaritmické rovnice\nAnalytická geometrie",
        "literature": "Polák, Přehled středoškolské matematiky, SPN 1990 a další vydání.\n\nStředoškolské učebnice matematiky pro gymnazia, případně pro\nprůmyslové školy (elektro).\nHoráčková, Hanáček, Matematický seminář,ISBN 978-80-88064-26-8",
        "annotation": "Cílem předmětu je zopakování vybraných témat středoškolské matematiky se zaměřením na kapitoly, které mohou usnadnit studium matematických a ekonomických předmětů na vysoké škole.\nZnalosti: Student zná základní definice a matematické postupy pro řešení příkladů středoškolské matematiky.\nDovednosti: Student umí počítat příklady z vybraných témat středoškolské matematiky.\nObecné způsobilosti:  Student se orientuje v základech středoškolské matematiky a dokáže je využívat při výuce ekonomických a matematických předmětů na vysoké škole.",
        "guarantor": "Mgr. Miroslav Hanáček ",
        "credits": 2
    },
    {
        "detail_id": 16,
        "course_id": "500041",
        "syllabus": "Idea iniciativy Průmyslu 4.0, model RAMI 4.0\nÚvod do problematiky řízení a řídicích systémů pro účely iniciativy Průmysl 4.0.\nSoučasné řídicí systémy, technologie a metody řízení velkých celků.\nArchitektura řídicí pyramidy, její HW a SW řešení v současné době.\nČinnosti a technologie na jednotlivých úrovních řídicí pyramidy.\nČidla a akční členy, programovatelné automaty, průmyslová PC, komunikační podsystém \nSCADA - Systémy vizualizace a operátorského řízení.\nMES – systémy operativního řízení výroby.\nERP systémy řízení podniku.\nPřipravenost stávajících technologií pro Industry 4.0\nŘídicí a průmyslové komunikační systémy v iniciativě Průmysl 4.0.\nTechnologické předpoklady iniciativy Průmysl 4.0. Digitalizace, virtualizace, decentralizace, otevřená komunikace a IoT, big data. \nNová řídicí architektura a význam otevřené komunikace. \nVýznam standardizace a standardy jednotlivých úrovní řídicí pyramidy, OPC, UA.\nModel RAMI – teoretický základ iniciativy Industry 4.0.\nIndustry 4.0 komponent model jako implementace RAMI 4.0 do komponent I 4.0 \nDigitální dvojče (DT) a Asset Administration Shell (AAS) \nVirtuální prostředí pro modelování výrobních procesů  \nPřípadové studie Industry 4.0.",
        "literature": "Zezulka F. - Prostředky průmyslové automatizace. VUTIUM, Brno, 2004.\nZezulka F. - Počítačové řídicí systémy, elektronický studijní materiál, VŠPJ.\nMANZEI Ch., SCHLEUPNER L., HEINZE Ronald (Hrsg.) - Industrie 4.0 im internationalen Kontext, VDE Verlag Beuth, 2015, ISBN 978-3-410-26049-3.\nwww.zvei.org: Industry 4.0 : Auf dem Weg zur smarten Fabrik, Die Elektroindustrie materials, 2015.\nwww.zvei.org: Elektrische Verbindungstechnik fuer Industrie 4.0, 2015.\nwww.zvei.org: Industrie – Software 4.0, 2015.",
        "annotation": "Cílem předmětu je dát studentů celkový přehled o významném trendu, který lze hodnotit jako čtvrtou průmyslovou revoluci. Úvodem budou studenti seznámeni s pojmem a obsahem ideje Průmysl 4.0 (anglicky Industry 4.0). Detailně pak budou probrány stávající řídicí architektury a systémy průmyslové automatizace jako celku a porovnány s architekturou řídicího systému především strojů a výrobních linek, jak jsou navrhovány pro potřeby systému Industry 4.0. Budou seznámeni s technologickými předpoklady a systémy na jednotlivých úrovních řízení. Pozornost bude věnována systémům Internetu věcí, služeb a lidí (IoT, IoS, IoP). Dále bude výklad zaměřen na významnou součást systému Industry 4.0 – komunikačnímu podsystému, dále systémům vizualizace a operátorského řízení (SCADA), systémům operativního řízeni MES a systémům řízení podniku ERP. Studenti budou seznámeni s tím, jak stávající průmyslové řídicí a informační systémy splňují kritéria a požadavky Industry 4.0. Velká pozornost bude věnována standardům a standardizačnímu procesu řídicích a výrobních systémů. Budou ovládat základní modely RAMI i model Industry 4.0 Components. Porozumí jejich implementaci do průmyslové výroby na základě případových studií (case study).\nZnalosti: Studenti budou mít celkový přehled o ideji i technologických předpokladech iniciativy Průmysl 4.0 (Industry 4.0). Budou mít základní znalosti o řídicích členech pro automatizaci strojů, výrobních linek i technologických procesů, systémy pro vizualizaci a operátorské řízení (SCADA) a systémy operativního řízení výroby (MES) ve stávajících řídicích a výrobních systémech a v tom jak splňují či nesplňují požadavky iniciativy Industry 4.0. Dostanou přehled o celé škále komunikačních systémů pro propojení prostředků jednotlivých úrovní mezi s sebou i navzájem mezi jednotlivými vrstvami jak ve stávajících decentralizovaných systémech, tak v systémech Industry 4.0. Porozumí modelům RAMI a Industry 4.0 Components a budou je umět aplikovat.\nDovednosti: Dovednosti v práci se SCADA systémy, základní i pokročilé dovednosti s MES systémem  a s komunikačními systémy třídy Industry Ethernet, Internet of Things (IoT), Internet of Services (IoS) a Internet of People (IoP). Tvorba případových studií v Industry 4.0 (case study).",
        "guarantor": "prof. Ing. František Zezulka, CSc. ",
        "credits": 4
    },
    {
        "detail_id": 17,
        "course_id": "500054",
        "syllabus": "hlavní zásady výstavby odborného textu\nkritické porozumění odbornému textu, poznámky, hodnocení\nabstrakt\nzásady správné citace, práce s bibliografickými informacemi\nseminární práce\nbakalářská práce\nprezentace výsledků studentské odborné činnosti\nprofesní životopis\nveřejné vystoupení, zásady ústní prezentace\npracovní pohovor, zásady diskuse",
        "literature": "Studijní opora \"Základy akademického psaní\" v LMS Moodle\nMeško D,. Katuščák D., Fin J.: - Akademická příručka. České, upr. vyd. Martin: Osveta, 2006. ISBN 80-8063-219-7\nCox K., Hill D.: - EAP now! English for academic purposes. [Nachdr.]. Frenchs Forest, N.S.W: Pearson Education, 2004. ISBN 1740910737\nGastel B., Day RA.: - How to write and publish a scientific paper. Eighth edition. Santa Barbara, California: Greenwood, an imprint of ABC-CLIO, 2016. ISBN 978-1440842801\nGILTROW, Janet. Academic writing: writing and reading in the disciplines. 3rd ed. Orchard Park, NY: Broadview Press, 2002. ISBN 1551113953.\nSeal B.: - Academic Encounters: Reading, Study Skills, and Writing. Content Focus. Human Behavior. Cambridge: Cambridge University Press, 1997. ISBN 0521476585\nZBÍRAL, David. Jak napsat (a nepsat) odbornou práci: Zásady, návody, časté chyby. In: David Zbíral [online]. 2018 [cit. 2022-04-25]. Dostupné z: http://www.david-zbiral.cz/odborne-prace.htm\nBORŮVKOVÁ, Jana, Stanislava DVOŘÁKOVÁ a Hana VOJÁČKOVÁ. Jak psát práce na VŠPJ: Typografická pravidla pro studenty VŠPJ. Jihlava, 2021.",
        "annotation": "Cílem předmětu je zváldnutí základních principů a forem akademického psaní a vyjadřování se pro účely vysokokolského studia. Cvičení jsou aplikačně orientována na rozlišování a používání vhodných jazykových registrů pro danou situaci a praktické užití nabytých odborných znalostí při přpravě studentských odborných prací a vystoupení.\nZnalosti: Student se orientuje v požadavcích na obsahově tematickou a jazykově kompoziční stavbu odborného textu. Student zná a umí použít jazykové registry vhodné pro základní formy studentských akademických prací a projevů, zná jejich jazykové a stylové normy a žánrová specifika.\nDovednosti: Student umí adekvátně pracovat se získanými informacemi, třídit je, analyzovat, reinterpretovat, hodnotit, správně citovat a prezentovat je. Dokáže efektivně vytvořit poznámky z odborného textu i přednášky, věcně diskutovat, efektivně prezentovat informace, tvořit odborný text, psát seminární a bakalářskou práci a abstrakt a obhájit svou práci.\nObecné způsobilosti: Student dokáže zpracovat odborné informace a prezentovat výsledky v rámci studentských prací v mluvené i psané podobě ve shodě s normami odborné komunikace.",
        "guarantor": "Mgr. Zdeňka Dostálová ",
        "credits": 2
    },
    {
        "detail_id": 18,
        "course_id": "500061",
        "syllabus": "Present, Past and Future ICT; present tenses\nComputer Essentials; past tenses\nCentral Processing Units; passive\nMain Memory; comparative and superlative adjective forms\nI/O Devices; modals\nStorage Devices; who/which/that\nOperating Systems; expressing future\nOffice Application Software; if-clauses (1st conditional) and future time clauses\nThe Internet; present perfect tenses\nCreative Software; questions\nProgramming; selected verb patterns\nJobs in ICT, CV, Applying for a Job; if-clauses (2nd conditional)",
        "literature": "Studijní opora \"Anglický jazyk pro informatiky\" v LMS Moodle\nMURPHY, Raymond.Essential grammar in use: a self-study reference and practice book for elementary learners of English. Fourth edition. Cambridge: Cambridge University Press, 2015. ISBN 978-1-107-48055-1\nA Dictionary of Computer Science. 7th Revised Edition. Oxford: OUP, 2016. ISBN 0199688974\nHYNEK, Jiří, VÍTKOVSKÝ, Radmil. Anglicko-český a česko-anglický slovník výpočetní techniky a informačních technologií = English-Czech Czech-English dictionary of computer science and information technology. 1. vyd. Plzeň: Fraus, 2000. 518 s. Speciál. Knihovna oborových slovníků. ISBN 80-7238-070-2.",
        "annotation": "Cíl: Cílem předmětu je zvládnutí odborného jazyka a prohloubení znalostí a dovedností z oblasti obecného jazyka. Cvičení jsou aplikačně orientována na praktické užití nabytých odborných znalostí, rozvoj všech jazykových dovedností a práci s autentickými a odbornými cizojazyčnými materiály a zdroji. Znalosti: Student se orientuje v gramatických strukturách na úrovni B1. Student zná a umí použít odbornou terminologii, umí definovat a vysvětlit odborné termíny svého oboru. Student zná zásady používání obecného a odborného jazyka v běžných profesních situacích, jako např. komunikace na pracovišti, emailová komunikace, profesní prezentace.Dovednosti: Student rozumí odbornému materiálu a orientuje se v něm. Je schopen v něm vyhledat informace, třídit je, analyzovat, reinterpretovat, citovat a prezentovat je. Gramatické znalosti umí student aplikovat v mluveném i písemném odborném projevu. Dokáže používat obecný i odborný jazyk v běžných profesních situacích.Obecné způsobilosti: Student se umí orientovat v odborné cizojazyčné literatuře a jiných zdrojích, umí zdroje citovat a veřejně prezentovat výsledky své práce.",
        "guarantor": "Mgr. Zdeňka Dostálová ",
        "credits": 3
    },
    {
        "detail_id": 19,
        "course_id": "500062",
        "syllabus": "Základy teorie množin\nAplikace teorie množin v informatice\nFormální logika, výrokový a predikátový počet\nAplikace formální logiky v informatice\nTeorie grafů, grafové algoritmy\nAplikace grafů v informatice\nÚvod do teorie algoritmů",
        "literature": "Studijní opora v LMS Moodle\nVANÍČEK, J. Teoretické základy informatiky. Kernberg, 2007. ISBN 978-80-903962-4-1.\nTRLIFAJOVÁ, K., VAŠATA., D. Matematická logika. Praha: ČVUT, 2013, 174 s. ISBN 978-80-01-05342-3.\nKOLÁŘ, J. Teoretická informatika. Praha: ČVUT, 2009, 204 s. ISBN 978-80-01-04331-8.\nDEMLOVÁ, M., PONDĚLÍČEK, B. Matematická logika. Praha: ČVUT, 1997, 160 s. ISBN 80-01-01683-8.\nMIŠOVIČ, M. Teoretické základy informatiky 1 - 4. Jihlava: VŠPJ, 2011.",
        "annotation": "Cílem předmětu je podat základní teoretické poznatky, týkající se výrokové a predikátové logiky, teorie množin, teorie grafů a teorie algoritmů.\nZnalosti: Student zná základy teorie množin, formální logiky a teorie grafů a algoritmů. Zná možnosti použití těchto teoretických oblastí v jednotlivých směrech informatiky a elektrotechniky.\nDovednosti: Student umí použít teoretické poznatky při řešení konkrétní úlohy (např. při klasifikaci dat, zápisu algoritmů, reprezentaci dat grafovými strukturami apod.).\nNávaznosti: Poznatky předmětu jsou využívány v dalších předmětech studijního plánu: Úvod do databázových systémů, Návrh a implementace databázových systémů, Datové struktury a algoritmy, Programovací jazyky a překladače, Umělá inteligence.",
        "guarantor": "Ing. Lenka Kuklišová Pavelková, Ph.D.",
        "credits": 5
    },
    {
        "detail_id": 20,
        "course_id": "500063",
        "syllabus": "Úpravy výrazů, řešení rovnic a nerovnic a jejich soustav\n\nAritmetické vektory\nMatice, determinanty \n\nŘešení soustav lineárních rovnic \nElementární funkce (grafy, vlastnosti z grafů)\n\nFunkce (vlastnosti z rovnice, inverzní funkce, cyklometrické funkce)\n\nLimita funkce \nDerivace funkce, l´Hospitalovo pravidlo\nVlastnosti funkce z limit a derivací\nExtrémy a průběh funkce\n\nNeurčitý integrál \nUrčitý integrál a jeho využití",
        "literature": "Studijní opora v LMS Moodle\n\nKLŮFA, J.: Učebnice matematiky pro studenty VŠE. Ekopress Praha, 2013\nHÁJKOVÁ, O.; JOHANIS, M.; JOHN, O.; KALENDA, O.; ZELENÝ, M.: Matematika. Matfyzpress Praha, 2012\n\nKRAUS, M.: Matematika 1, učební text VŠP Jihlava, 2008",
        "annotation": "Cílem předmětu je vybavit posluchače základními znalostmi z oblasti matematické analýzy, a to především diferenciálního a integrálního počtu funkce jedné reálné proměnné. Posluchači by si měli osvojit základní početní dovednosti důležité pro práci s funkcemi jedné proměnné a pro řešení soustav lineárních rovnic. Přednášky jsou zaměřeny na výklad jednotlivých pojmů, základních početních postupů a řešení vzorových příkladů. Cvičení slouží k procvičování látky.\nZnalosti: Absolvent zná základní věty a definice, které jsou obsahem předmětu, zná souvislosti a vztahy mezi studovanými objekty a dokáže je vysvětlit.\nDovednosti: Absolvent dokáže řešit soustavy lineárních rovnic vhodnými metodami. Je schopen pomocí diferenciálního počtu načrtnout grafy elementárních funkcí. Dovede určit primitivní funkci a užít ji. Absolvent předmětu dokáže využívat získaných matematických znalostí při dalším studiu odborných přírodovědných a technických předmětů.\nObecné způsobilosti:  Absolvent je schopen pracovat s funkcemi jedné proměnné, které jsou základním popisem závislosti veličin.  Dále je absolvent obeznámen se základními algoritmy lineární algebry, které jsou základem pro lineární programování sloužící k optimalizaci lineárních problémů.",
        "guarantor": "RNDr. Radek Stolín, Ph.D. ",
        "credits": 5
    },
    {
        "detail_id": 21,
        "course_id": "500064",
        "syllabus": "Charakteristika sítí, rozdělení, topologie\nPasivní a aktivní prvky sítě – opakovače, rozbočovače, mosty, brány\nSíťový přenos, model ISO/OSI\nKomunikační protokoly, rámce, ethernet, fast ethernet\nArchitektura TCP/IP\nProtokoly TCP/IP, IP, IP adresa, subnet, CIDR\nProtokoly TCP/IP – ARP, ICMP, IGMP, TCP, UDP\nSměrování v sítích TCP/IP, RIP, OSPF, BGP\nFirewally\nSlužby DNS, DHCP\nSlužby SMTP, POP3, IMAP\nSlužby FTP, HTTP\nWI-FI\nISDN, xDSL",
        "literature": "PUŽMANOVÁ, R. Bezpečnost bezdrátové komunikace, 1. vyd. Brno: CP Books. Technická literatura, 2005 – 179 s. ISBN: 80-251-0791-4\nPUŽMANOVÁ, R. Moderní komunikační sítě od A do Z. 2. vyd. Brno: Computer Press, 2006. ISBN 80-251-1278-0.\nKABELOVÁ, A., DOSTÁLEK, L. Velký průvodce protokoly TCP/IP a systémem DNS. 5.vyd. Brno: Computer Press, 2012. ISBN 978-80-251-2236-5.\nZANDL, P. Bezdrátové sítě WiFi: Praktický průvodce. Brno: Computer Press, 2003. ISBN 80-722-6632.\nTANENBAUM, A. S., WETHERALL, D. J. Computer Network.s 5th ed. Prentice Hall, 2010. ISBN 978-0132126953.\nKÁLLAY F., PENIAK P. Počítačové sítě LAN/MAN/WAN a jejich aplikace. 2. vyd. Praha: Grada, 2003. ISBN 80-247-0545-1.\nGAST, M., S. 802.11ac A Survival Guide.2nd release. O'Reilly Media, Inc., 2015. ISBN 978-1-449-34314-9\nFOROUZAN, B. TCP/IP Protocol Suite. McGraw-Hill Science/Engineering/Math, 2009. ISBN 978-0073376042.",
        "annotation": "Tento předmět je teoretických i praktickým úvodem do počítačových sítí. Po vysvětlení základních pojmů je probírán referenční model ISO/OSI. Pokračuje se výkladem prvků sítě, komunikačních protokolů a rámců. Následuje podrobnější výklad protokolů, směrování v sítích a základních služeb. Nakonec je probírán bezdrátový přenos a xDSL technologie. Na přednášky navazují intenzivní, prakticky zaměřená cvičení s využitím operačního systému linux.Znalosti: Student ovládá terminologii počítačových sítí, zná jejich základní prvky, služby, protokoly. Zná základní konfigurace počítačových sítí, ví, jakým způsobem lze bezpečně využívat základní služby.Dovednosti: Student umí konfigurovat TCP/IP protokol, routování, firewall, umí detailně nakonfigurovat služby DNS, DHCP, SMTP, POP3, IMAP, FTP, HTTP. Student umí nakonfigurovat bezdrátové prvky sítě (klient, Access Point, bridge) s důrazem na bezpečný provoz.Obecné způsobilosti: Studenti mají obecné znalosti o současných počítačových sítích, aktivních a pasivních prvcích, základních protokolech využívaných v těchto sítích.",
        "guarantor": "Mgr. Antonín Přibyl ",
        "credits": 5
    },
    {
        "detail_id": 22,
        "course_id": "500065",
        "syllabus": "Network characteristics, classification, topology\nPassive and active network elements – repeaters, hubs, bridges, gateways\nNetwork transmission, ISO/OSI model\nCommunication protocols, frameworks, Ethernet, fast Ethernet\nTCP/IP protocol architecture\nIP address, subnet, CIDR\nTCP/IP family suite protocols – ARP, ICMP, IGMP, TCP, UDP\nRouting in TCP/IP, RIP, OSPF, and BGP network\nFirewalls\nDNS and DHCP services\nSMTP, POP3, and IMAP services\nFTP and HTTP services\nWireless transmission – WI-FI\nISDN, xDSL",
        "literature": "TANENBAUM, A. S., WETHERALL, D. J. Computer Network.s 5th ed. Prentice Hall, 2010. ISBN 978-0132126953.\nGAST, M.,S. 802.11ac A Survival Guide.2nd release. O'Reilly Media, Inc., 2015. ISBN 978-1-449-34314-9.\nFOROUZAN, B. TCP/IP Protocol Suite. McGraw-Hill Science/Engineering/Math, 2009. ISBN 978-0073376042",
        "annotation": "The course provides both theoretical and practical introduction into computer networks. After explaining basic terms the ISO/OSI reference model is studied. Next, network elements, communication protocols and frames are explained. A detailed explanation of protocols, routing in networks and basic services follows. Finally, wireless transmission and xDLS technology is studied. Lectures are followed by intensive practically oriented exercises using Linux operating system.  Knowledge: The student knows the terminology of computer networks, knows their basic elements, services, protocols. They know basic computer network configurations; they know how basic services can be securely used.Skills: The student can configure a TCP/IP protocol, routing, firewall, they can configure DNS, DHCP, SMTP, POP3, IMAP, FTP, and HTTP services in detail. The student can configure wireless network elements (client, Access Point, bridge) with an emphasis on safe operation. Competences: The students have general knowledge of contemporary computer networks, active and passive elements, and basic protocols used in these networks.",
        "guarantor": "Mgr. Antonín Přibyl ",
        "credits": 5
    },
    {
        "detail_id": 23,
        "course_id": "500067",
        "syllabus": "Algoritmus, program, vývojový diagram, diagram aktivity. \nÚvod do programovacích jazyků, překladače.\n\nReprezentace dat v paměti počítače, základní datové typy, proměnné, konstanty, přetypování.\n\nOperátory a jejich priorita, výrazy. \nZákladní příkazy.\n\nŘízení běhu programu - řídicí struktury.\n\nRozklad problému na podproblémy, procedurální přístup, rekurze.\nFunkce a procedury.\n\nStrukturované datové typy.\n\nUkazatel, dynamická alokace paměti, předávání parametru hodnotou a odkazem.\n\nFunkce vstupu/výstupu, práce se soubory.\n\nPříklady, algoritmy vyhledávání a řazení.",
        "literature": "HEROUT, P.: Učebnice jazyka C – 2. díl, 4 vyd., České Budějovice: KOPP, 2008.\nHEROUT, P.: Učebnice jazyka C. 6. vyd. České Budějovice: Kopp, 2009, 271, viii s. ISBN 978-80-7232-383-8.\nWIRTH, N.: Algorithms data structures=programs. Englewood Cliffs, N.J.: Prentice-Hall, 1976, 366 p. ISBN 01-302-2418-9.\nVIRIUS, M.: Základy algoritmizace. 1. vyd. Praha: České vysoké učení technické, 1995. ISBN 80-010-1346-4.\nKLEMENS, B.: 21st Century C: C Tips from the New School, O'Reilly, 2014.\nKERNIGHAN, B.W., RITCHIE, D.M.: The C Programming Language. Prentice-Hall, 2012.",
        "annotation": "Předmět je úvodem do algoritmizace a základů programování v jazyce C. Důraz je kladen na využití procedurálního přístupu, student se naučí principy procedurálního programování, jak pracovat s datovými typy, výrazy a příkazy jazyka, princip volání funkcí a předávání parametrů. Získané dovednosti by měl umět použít při řešení konkrétních úloh. Umí rozdělit problém na podproblémy a řešit jej systémem procedur (funkcí) v daném programovacím jazyce.",
        "guarantor": "doc. Ing. Karel Richta, CSc.",
        "credits": 5
    },
    {
        "detail_id": 24,
        "course_id": "500068",
        "syllabus": "Algorithm, program, flowchart. Introduction into programming languages, compilers.\n\nData representation in the computer memory, basic data types, variables, constants, type conversion.\n\nOperators and their priority, expressions. \nBasic commands.\n\nRunning control of the program - control structures.\n\nDecomposing a problem into sup-problems, procedural approach, recursion.\n\nFunctions and procedures.\n\nStructured data types.\n\nIndex, dynamic memory allocation, parameter passing by value and link.\n\nInput/output function, work with files.\n\nAlgorithms for searching and sorting, introduction to the complexity of algorithms.",
        "literature": "HEROUT, P.: Učebnice jazyka C – 2. díl, 4 vyd., České Budějovice: KOPP, 2008.\nHEROUT, P.: Učebnice jazyka C. 6. vyd. České Budějovice: Kopp, 2009, 271, viii s. ISBN 978-80-7232-383-8.\nWIRTH, N.: Algorithms data structures=programs. Englewood Cliffs, N.J.: Prentice-Hall, 1976, 366 p. ISBN 01-302-2418-9.\nVIRIUS, M.: Základy algoritmizace. 1. vyd. Praha: České vysoké učení technické, 1995. ISBN 80-010-1346-4.\nKLEMENS, B.: 21st Century C: C Tips from the New School, O'Reilly, 2014.\nKERNIGHAN, B.W., RITCHIE, D.M.: The C Programming Language. Prentice-Hall, 2012.",
        "annotation": "The course is an introduction to algorithmization and fundamentals of programming in C language. The use of a procedural approach is emphasized and the student learns the principles of procedural programming, how to work with data types, language expressions and commands, the principle of calling functions and passing parameters. Acquired skills should be used to solve particular tasks. Students can divide a problem into sub-problems and solve it with a system of procedures (functions) in the given programming language.",
        "guarantor": "doc. Ing. Karel Richta, CSc.",
        "credits": 5
    },
    {
        "detail_id": 25,
        "course_id": "500070",
        "syllabus": "www stránky – základní části, obrázky, tabulky\nObrázky – klikací mapy, pozicování pomocí tabulky, formuláře, HTML5\nNastavení hlavičky stránky, validace\nKaskádové styly – úvod, vlastnosti písma, barvy a pozadí, úprava slov, třídy, formátování textu, boxy, umístění stylů\nKaskádové styly, rámečky, obrázkové pozadí, z-index, tabulky, pseudotřídy, seznamy\nPozicování pomocí kaskádových stylů\nJavaScript – úvod, proměnné, funkce, větvení, logické operátory, dialogová okna, cyklus, okna, kontrola formulářů, objekty\nPHP – datové typy, pole, operátory, větvení, cykly, funkce\nFormuláře a jejich kontrola, regulární výrazy\nDatabáze, přístup k databázi pomocí PHP\nPráce s více tabulkami současně v PHP, PDF\nZabezpečení stránek, cookies, session\nPHP datum a čas, textové řetězce",
        "literature": "Studijní opora v LMS Moodle\nLACKO, L.\tAjax hotová řešení. 1. vyd. Brno : Computer Press, 2008. 269 s. ISBN 978-80-251-2108-5\nLAVIN, P.\tPHP - objektově orientované: koncepty, techniky a kód. 1. vyd. Praha: Grada, 2009. 211 s. ISBN 978-80-247-2137-8\nSCHLOSSNAGLE, G.\tPokročilé programování v PHP 5. 1. vyd. Brno: Zoner Press, 2004. 640 s. ISBN 80-86815-14-5\nSHARKIE, C. a A. FISHER.\tResponzivní webdesign: okamžitě. Brno: Computer Press, 2015. ISBN 978-802-5143-841",
        "annotation": "Cílem předmětu je naučit studenta používat základní webové technologie jako například html, css, javascript, php pro tvorbu webové aplikace. Dalším cílem je, aby student uměl pracovat s bází dat a pomocí aplikace tato data zobrazovat, mazat, přidávat a opravovat.Znalosti: Student zná jazyk html (xhtml), kaskádové styly a javascript pro vytváření www stránek. Dále zná základy skriptovacího jazyka pro vytváření webové aplikace. Umí pracovat s bází dat a pomocí php s těmito daty pracovat.Dovednosti: Student umí navrhnout a realizovat jednoduchou webovou aplikaci, která pracuje s databází. U této aplikace umí realizovat různé uživatelské přístupy (práva).Obecné způsobilosti: Student se orientuje v trendech vytváření webových stránek a webových aplikací.",
        "guarantor": "PaedDr. František Smrčka, Ph.D. ",
        "credits": 5
    },
    {
        "detail_id": 26,
        "course_id": "500071",
        "syllabus": "Data a informace, modelování reality\nZáklady softwarového inženýrství\nDatabázový systém, SŘBD, databázové modelování\nKonceptuální model\nRelační model dat\nRelační algebra\nTransformace E-R schematu do RMD\nJazyk SQL - jazyk pro definici dat, jazyk pro manipulaci s daty, dotazování\nZáklady normalizace",
        "literature": "BUREŠ, Z. Databázové systémy 1. Studijní opora. Jihlava: VŠPJ, 2014. ISBN 978-80-87035-88-7.\nBUREŠ, Z. Databázové systémy 1. Sebrané přednášky.\nBUREŠ, Z. Databázové systémy 1. Sbírka řešených příkladů ke cvičením. Jihlava: VŠPJ, 2011.\nVALENTA, M. Databázové systémy [online]. Praha: ČVUT, 2010. Dostupné z: https://edux.fit.cvut.cz/oppa/BI-DBS\nPOKORNÝ, J. - HALAŠKA, I. Databázové systémy. 1. vyd. Praha: ČVUT, 2004. 148 s. ISBN 80-01-02789-9.\nVALENTA, M. Jazyk SQL [online]. Praha: ČVUT, 2010. Dostupné z: https://edux.fit.cvut.cz/oppa/BI-SQL\nPostgreSQL Documentation [online]. [cit. 2021-02-18]. Dostupné z: https://www.postgresql.org/docs/",
        "annotation": "Předmět je úvodem do databázových systémů. Zabývá se metodikou návrhu a základy implementace databázových systémů. Věnuje se konceptuálnímu modelování, návrhu a normalizaci relačního schématu a jazyku SQL.\nZnalosti: Student zná základní teorii a principy týkající se konceptuálního návrhu databáze, logického (zejména relačního) modelu a dotazování. Student zná základy normálních forem a normalizace.\nDovednosti: Student umí navrhnout konceptuální model databáze, transformovat jej do logického modelu a implementovat databázi v rámci zvoleného databázového stroje. Student ovládá základní práci s databází v jazyce SQL, tj. tvorbu a změnu databázového schématu, vkládání, mazání a úpravu dat, tvorbu dotazů nad databází.",
        "guarantor": "doc. Ing. Zbyněk Bureš, Ph.D. ",
        "credits": 5
    },
    {
        "detail_id": 27,
        "course_id": "500072",
        "syllabus": "Data and information, reality modelling\nFundamentals of software engineering\nDatabase system, DBMS, database modelling\nConceptual model\nRelational data model\nRelational algebra\nTransformation of E-R schema to RMD\nSQL – language for data definition, language for data manipulation, querying \nFundamentals of normalization",
        "literature": "GARCIA-MOLINA, H. - ULLMAN, D.J. - WIDOM, J. Database systems: the complete book. 2. vyd. New Jersey: Pearson Prentice Hall, 2008. ISBN 0-13-187325-3.\nBUREŠ, Z. Databázové systémy 1. Studijní opora. Jihlava: VŠPJ, 2014. ISBN 978-80-87035-88-7.\nPostgreSQL Documentation [online]. [cit. 2021-02-18]. Dostupné z: https://www.postgresql.org/docs/",
        "annotation": "The course is an introduction into database systems. It deals with the methodology of design and fundamentals of database systems implementation. It handles conceptual modelling, design and normalization of the relational diagram, and SQL.\nKnowledge: Students know the basic theory and principles of conceptual database design, logical (especially relational) model and making queries. Students know basics of normal forms and normalization.  \nSkills: Students can design a conceptual model of a database; they can transform it to a logical model and to implement the database within chosen database engine. Student can do the basic work with database in SQL, i.e. creating and changing the database diagram, inserting, deleting and editing data, and querying a database.",
        "guarantor": "doc. Ing. Zbyněk Bureš, Ph.D. ",
        "credits": 5
    },
    {
        "detail_id": 28,
        "course_id": "500074",
        "syllabus": "Layouty webových stránek, HTML jazyk\nCSS2 vlastnosti\nCSS3 vlastnosti\nHTML5 struktura webu\nResponzivita webu\nBootstrap technologie\nProjekt - webová stránka\nGUI pro OS – úvod do Win Forms v C#\nWinForms – základní komponenty\nWinForms – aplikace 1\nWinForms – aplikace 2\nWinForms – aplikace 3\nWinForms – aplikace 4\nProjekt – aplikace dle předem schváleného tématu",
        "literature": "SHARP, J. Microsoft Visual C# 2010: krok za krokem. Brno: Computer Press, 2010. Krok za krokem (Computer Press). ISBN 9788025131473.\nMACDONALD, M., SZPUSZTA, M. ASP.NET 3.5 a C# 2008: tvorba dynamických stránek profesionálně. Brno: Zoner Press, 2008. Encyklopedie Zoner Press. ISBN 978-80-7413-008-3.\nPREECE, J., SHARP, K., ROGERS, Y. Interaction Design: Beyond Human-Computer Interaction,  4th Edition. Wiley, 2015, 584 s., ISBN : 978-1-119-02075-2\n\n(X)HTML, CSS - https://www.jakpsatweb.cz\nKaskádové styly - https://www.w3schools.com/css/default.asp\nBootstrap - https://www.w3schools.com/bootstrap/bootstrap_ver.asp",
        "annotation": "Cílem předmětu je získat všeobecný přehled nad problematikou tvoření uživatelských rozhraní nejen pro Windows aplikace, ale také pro aplikace na webu.\nPo absolvování toho předmětu budou studenti schopni samostatně navrhnout a naprogramovat libovolné rozhraní dle potřeb zákazníka pro webovou nebo windows aplikaci.",
        "guarantor": "Mgr. Bc. Petr Jelínek",
        "credits": 4
    },
    {
        "detail_id": 29,
        "course_id": "500075",
        "syllabus": "Principy objektového programování, třídy a jejich použití.\n\nStruktura objektu, atributy a metody.\n\nDynamický charakter objektu, konstruktor, destruktor, instance třídy.\n\nDědičnost, hierarchie tříd, kompozice.\n\nPřetěžování metod, přetěžování operátorů.\n\nSoubory a proudy.\n\nAbstraktní třídy, polymorfismus, virtuální metody.\n\nVýjimky a jejich zpracování.\n\nŠablony.\n\nStandardní knihovny šablon.\n\nVlákna",
        "literature": "VIRIUS, M.: Jazyky C a C++. Praha: Grada, 2011. ISBN: 978-80-247-3917-5.\nPECINOVSKÝ, R.: OOP – Naučte se myslet a programovat objektově. Brno: Computer Press 2010, ISBN 978-80-251-2126-9.\nCORMEN, LEISERSON, RIVEST, and STEIN: Introduction to Algorithms, 3rd Edition, MIT Press, 2009.\nSTROUSTRUP: Programming: Principles and Practice Using C++ (2nd Edition), Addison-Wesley, 2014.\nSTROUSTRUP: The C++ Programming Language (4th Edition), Addison-Wesley, 2013.",
        "annotation": "Předmět navazuje na předmět Základy strukturovaného programování  a je úvodem do objektového programování. Je představen objektový přístup, řešení problému systémem tříd, polymorfismus, přetěžování, dědičnost, události, výjimky. Student se naučí, jak pomocí objektových programovacích technik sestavit jednoduchý program. Umí rozdělit problém na podproblémy a řešit jej systémem tříd. Umí používat základní knihovny.",
        "guarantor": "Ing. Marek Musil",
        "credits": 5
    },
    {
        "detail_id": 30,
        "course_id": "500076",
        "syllabus": "Introduction to software engineering\n\nBusiness process modelling\n\nModelling requirements – cases of use\n\nAnalysis of the problem domain - analytic classes, attributes, statuses, relations\n\n\nSoftware systems architecture\n\nDesign – design classes and patterns\n\nDesign – interfaces and components\n\nApplication testing\n\nSoftware development methodologies, model-driven development\n\nClassical methodologies, unified development process and its variants\n\nAgile methodologies",
        "literature": "FOWLER, M.: Destilované UML. ISBN 978-80-247-2062-3, Grada, 2009.\n\nARLOW, J. - NEUSTAT, I.: UML 2 a unifikovaný proces vývoje aplikací. ISBN 8025115038, Computer Press, 2007.\n\nCRAIG L.: Applying UML and Patterns: An Introduction to Object-Oriented Analysis and Design and Iterative Development (3rd Edition). Prentice Hall, 2009.\nPRESSMAN: Software Engineering (7. vydání). McGraw-Hill, 2009.\nSOMMERVILLE, I.: Software Engineering (9. vydání). Addison-Wesley, 2011.",
        "annotation": "Students will be acquainted with engineering methods of software analysis and design. In particular, emphasis will be placed on software development, the scope of which requires cooperation in a team. These procedures will be discussed not only in theory, but students will also have the opportunity to practise them in exercises. Work on real or fictitious projects will be done in teams and students will verify meaningful use of engineering practices in creating relatively large programs. To implement the projects, students will use, among other things, UML and BPMN modelling language, CASE tools, tools for project management and resource planning, and tools for teamwork.",
        "guarantor": "doc. Ing. Karel Richta, CSc.",
        "credits": 5
    },
    {
        "detail_id": 31,
        "course_id": "500078",
        "syllabus": "Datový soubor, měření a typy veličin, možné problémy. Statistické výpočetní systémy\nDeskriptivní statistika, základní pojmy, jejich hierarchie, klasifikace, třídění\nMěření úrovně a variability datového souboru (momenty a momentové charakteristiky) \nChyby a nejistoty měření, průzkumová analýza, odlehlé hodnoty\nMetoda nejmenších čtverců, regresní a korelační úloha \nZávislost slovních znaků (asociace a kontingence) \nNáhodné jevy a pravděpodobnosti, opakované pokusy \nDiskrétní náhodné veličiny, spojité náhodné veličiny a jejich důležitá rozdělení \nNormální rozdělení spojité náhodné veličiny\nNáhodný výběr, statistiky, bodový odhad \nIntervalový odhad založený na normalitě \nTestování hypotéz založené na normalitě – postup při testování a možné chyby\nZákladní parametrické a neparametrické testy",
        "literature": "MINAŘÍK, B. Statistické minimum pro studenty bakalářského studia na technických oborech. Jihlava: Vysoký škola polytechnická, 2014. ISBN 978-80-88064-03-9\nKOŽÍŠEK, J., STIEBEROVÁ, B. Statistika v příkladech. Praktické aplikace řešené v MS Excel. Praha: Verlag Dashofer, 2012, 287 s., ISBN 978-80-86897-48-6\nŠPALEK, J. Aplikovaná statistika I. Brno: Masarykova univerzita, 2004. ISBN 80-210-3412-2\nŠPALEK, J. Aplikovaná statistika II. Brno: Masarykova univerzita, 2004. ISBN 80-210-3413-0",
        "annotation": "Cílem tohoto kurzu je seznámit studenty se základními statistickými pojmy a postupy při zpracování a analýze empirických dat v oboru elektrotechniky a informatiky. Ve druhé části předmětu jde pak o pochopení základních pojmů pravděpodobnosti a principů práce s diskrétními a spojitými náhodnými veličinami s důrazem na prakticky v daném oboru využívaná rozdělení, především na normální rozdělení pravděpodobnosti spojité náhodné veličiny. Poslední částí jsou elementy matematické statistiky, práce s náhodným výběrem a základní úlohy statistické indukce (odhady, testy hypotéz) o středních hodnotách normálního a alternativního rozdělení.\nZnalosti: Student chápe a ovládá základní principy popisné statistiky — vznik datového souboru jako výsledek měření, třídění datového souboru a určování jeho významných hodnot.  Rozumí základním statistickým vlastnostem datového souboru a ovládá principy jejich měření pomocí souhrnných charakteristik (měření úrovně, variability a rámcově i dalších vlastností, s důrazem na charakteristiky založené na momentech). Student umí pracovat s rozděleními pravděpodobnosti vybraných rozdělení diskrétních a spojitých náhodných veličin. Student chápe a ovládá základní principy statistické indukce (bodový a intervalový odhad, testování hypotéz) založené na normalitě náhodných veličin. Je schopen samostatné interpretace příslušných charakteristik. Chápe princip metody nejmenších čtverců a její uplatnění při měření stochastických závislostí.\nDovednosti: Student umí provést bodové nebo intervalové třídění číselných dat, prezentovat ho tabulkou i graficky a určit významné hodnoty datového souboru.  Student umí vypočítat souhrnné charakteristiky souboru  tříděných i netříděných dat a získané výsledky interpretovat. Student umí nakreslit grafy pravděpodobnostních a distribučních funkcí, resp. hustot několika základních rozdělení pravděpodobnosti diskrétních a spojitých veličin a určit jejich charakteristiky polohy a variability.  Student umí řešit úlohy s normálním rozdělením pravděpodobnosti.  Student umí konstruovat bodové a intervalové odhady neznámých parametrů rozdělení založené na normalitě. Student umí řešit a interpretovat výsledky několika základních testů hypotéz o parametrech rozdělení založené na normalitě testových kritérií. Umí naměřené hodnoty proložit regresní čarou a interpretovat získané výsledky. Student umí pracovat a řešit úlohy ve statistických výpočetních systémech a interpretovat získané výsledky.\nObecné způsobilosti:  Student je orientován v oblasti základů popisné a matematické statistiky. Chápe význam pravděpodobnosti, principu praktické jistoty a pojmu rizika. Znalosti pravděpodobnosti náhodných jevů a veličin je schopen aplikovat na jednoduché případy statistické indukce založené na normalitě rozdělení příslušných náhodných veličin. Je schopen měřit průběh a intenzitu stochastických závislostí. Je schopen své znalosti vhodně uplatnit v ostatních předmětech svého studijního oboru a při zpracování bakalářské práce.",
        "guarantor": "RNDr. Ing. Martina Zámková, Ph.D. ",
        "credits": 5
    },
    {
        "detail_id": 32,
        "course_id": "500079",
        "syllabus": "Základní datové struktury pole a seznam.\nOperační a paměťová složitost algoritmů.\nAlgoritmy řazení a jejich operační složitost.\nAlgoritmy asociativního a adresního vyhledávání a jejich operační složitost.\nSpecifikace a implementace datových typů, datové typy Zásobník, Fronta, Pole, Množina, Seznam, Tabulka, Strom, Graf.\nKnihovna STL, kontejnery a algoritmy knihovny STL.",
        "literature": "Hudec, B.: Algoritmy v C++, elektronický studijní text pro kombinovanou formu studia, Vysoká škola polytechnická Jihlava, 2012.\nMareš, M., Valla, T.: Průvodce labyrintem algoritmů, CZ.NIC, z.s.p.o., 2017.\nJosuttis: C++ Standardní knihovna a STL, Computer Press Praha, 2005.\nVirius, M.: Jazyky C a C++. Grada Publishing, a.s., Praha, 2006.",
        "annotation": "Studenti získají přehled o efektivních algoritmech a datových strukturách pro řešení standardních úloh, především typu vyhledávání a řazení nad dynamicky se měnícími vstupními údaji. Podrobně se seznámí se základními kontejnery (úložišti dat) jako jsou vektor, pole, zásobník, fronta, seznam, množina a tabulka. S jejich pomocí se naučí implementovat a využívat vybrané problémově orientované dynamické datové struktury, jako např. rozptylovací tabulky, vyhledávací stromy, vyvažované vyhledávací stromy, haldy, či B-stromy. Základní přehled získají i o grafových a optimalizačních algoritmech.\nZnalosti: Student zná základní algoritmy zpracování časově i strukturně heterogenních dat zejména z oborů řazení a vyhledávání včetně odpovídajících základních kontejnerů (úložišť dat) a forem implementace.\nDovednosti: Student umí specifikovat řešený problém, zvolit pro něj nejvýhodnější reprezentaci dat a navrhnout algoritmy požadovaných operací. Úlohu je schopen naprogramovat v jazyce C++ a zhodnotí paměťovou a operační složitost své implementace.",
        "guarantor": "doc. Dr. Ing. Jan Voráček, CSc. ",
        "credits": 5
    },
    {
        "detail_id": 33,
        "course_id": "500080",
        "syllabus": "Úvod do řízení softwarových projektů\nModelování obchodních procesů\nFormalizace uživatelských požadavků\nPlánování SW projektu agilními metodikami\nOrganizace projektu - tvorba týmu a charakteristika typických rolí v modelu Scrum\nAnalýza rizik - možná rizika, pravděpodobnost výskytu, redukce \nKvalitativní aspekty a metriky SW projektů\nPrůběžné monitorování a řízení projektů \nPředání výsledků zákazníkovi (review) a zhodnocení práce týmu (retrospektiva)",
        "literature": "ŠOCHOVÁ, Z., KUNCE, E., Agilní metody řízení projektů. ComputerPress 1. 2014, 176 s., ISBN 978 80 251-4194-62.\nGUCKENHEIMER, S., PEREZ, J. J Efektivní softwarové projekty. 1. vyd. Brno: Zoner Press, 2007, 255 s. ISBN 978-80-86815-62-6.\nSCHWALBE, K. Řízení projektů v IT. Computer Press, 2011, ISBN:9788025128824.\nWYSOCKI, R.K. Effective project management, Wiley, 2014, ISBN: 978-1-118-72916-8.",
        "annotation": "Studenti se v rámci předmětu seznámí s inženýrskými postupy při řízení tvorby softwaru formou týmových softwarových projektů. V úvodní části kurzu budou seznámeni s agilními metodikami a souvisejícími projektově-manažerskými nástroji. Naučí se také spolupracovat prostřednictvím sdíleného úložiště a efektivně komunikovat. V další části kurzu budou zpracovávat zadaný problém, přičemž důraz bude kladem především na jeho řádné naplánování, průběžné řízení a vyhodnocování kvantity i kvality realizované práce. Naučí se tak kriticky hodnotit a zlepšovat individuální i týmové aktivity. Na závěr kurzu budou mít možnost srovnat své výsledky s výstupy ostatních týmů.\nDovednosti: Student umí odhadnout náročnost všech součástí i fází projektu, rutinně pracuje s jeho funkčními i kvalitativními metrikami. Zná základní způsoby a nástroje řízení agilních projektů, umí pracovat s týmovým datovým úložištěm a efektivně komunikovat. K zadanému problému je schopen zvolit a programově realizovat optimální architekturu. Dokáže připravit použitelná a uživatelsky přívětivá rozhraní. Orientuje se v problematice návrhu testů i vyhodnocování jejich výsledků.\nDovednosti: Student umí odhadnout náročnost všech součástí i fází projektu, rutinně pracuje s jeho funkčními i kvalitativními metrikami. Zná základní způsoby a nástroje modelování požadavků, k danému problému je schopen zvolit a programově realizovat optimální architekturu. Dokáže připravit použitelná a uživatelsky přívětivá rozhraní. Orientuje se v problematice návrhu testů i vyhodnocování jejich výsledků.\nObecné způsobilosti: Student dokáže sestavit, řídit a motivovat tým. Je schopen definovat jeho nezbytné základní i nadstavbové procesy, které dále průběžně zlepšuje a zkvalitňuje. Dokáže řídit jak rozsáhlé vývojové projekty, tak i dlouhodobé procesy údržby SW. Aktivně ovládá také problematiku IT managementu v organizacích.",
        "guarantor": "doc. Dr. Ing. Jan Voráček, CSc. ",
        "credits": 4
    },
    {
        "detail_id": 34,
        "course_id": "500081",
        "syllabus": "Informace, informační systém, rozdělení informačních systémů, požadavky na vývoj informačního systému.\nTeoretická východiska pro vývoj informačního systému, tvorby architektury IS, pojetí byznys procesů a transakcí, postupy verifikace procesní a datové analýzy.\nHlavní zásady implementace informačního systému, výběr vhodného software nebo/ a technologie, moderní přístupy/ softwarové technologie pro realizaci informačních systémů.\nObjektová metodika pří budování IS, modelování procesů a dat, nové přístupy při řešení IS pro podporu byznys procesů.\nPraktická ukázka postupu při vývoji IS pomocí metod objektově orientovaného přístupu.\nZákladní principy podnikových aplikací kategorie ERP (Enterprise Resource Planning), jednotlivé části a vazby na další aplikační subsystémy.\nZákladní principy podnikových aplikací kategorie CRM (Customer Relationship Management), jednotlivé části a vazby na další aplikační subsystémy.\nZákladní principy podnikových aplikací kategorie SCM (Supply Chain Management), jednotlivé části.",
        "literature": "MIŠOVIČ, M. Informační systémy. Studijní opora VŠP Jihlava, 2011.\nGÁLA, L., POUR, J., ŠEDIVÁ, Z. \tPodniková informatika. 3., aktualizované vydání Grada, 2015, 240s. ISBN 978-80-247-5457-4.\nBASL, J., BLAŽÍČEK, R. \tPodnikové informační systémy. 3., aktualizované a doplněné vydání. Grada, 2012, 323s. ISBN 978-80-247-4307-3.\nROMNEY, M. B., STEINBART, P.J. \tAccounting Information Systems, 12e nebo novější. Prentice Hall, 2012, 720s. ISBN 978-01-325-5262-2.",
        "annotation": "Předmět seznamuje studenty s principy a metodami softwarových aplikací používaných v informačních systémech, postupy návrhu, realizace a provozu informačních systémů. Hlavní pozornost je zaměřena na objasnění aplikací kategorie ERP (Enterprise Resource Planning), jejich funkcionalitu a vazbu na další podnikové aplikace, zejména SCM (Supply Chain Mangement), CRM (Customer Relationship Management). Studenti budou současně seznámeni na příkladu ERP s postupem implementace podnikového IS.\nZnalosti: Student zná principy a metody softwarových aplikací v informačních systémech pro podporu byznys procesů ve všech typech organizací.\nDovednosti: Student má znalosti v oblasti implementace, testování, provozování a praktického použití ERP v podnikové praxi.",
        "guarantor": "Ing. Jakub Novotný, Ph.D. ",
        "credits": 4
    },
    {
        "detail_id": 35,
        "course_id": "500082",
        "syllabus": "Overview of programming languages and programming paradigms.\nCompiler structure,front-end and back-end. Virtual machines.\nFinite automata and their implementation.\nLexical analysis, principles and implementation.\nContext-free grammars and pushdown automata.\nLL(1) grammars and top-down parsing.\nLALR(1) grammars and bottom-up parsing. \nIntermediate code, symbol table, run-time properties.\nOptimizations.",
        "literature": "MOGENSEN, T. AE. Basics of Compiler Design Anniversary edition. 3. vyd. University of Copenhagen: lulu.com, 2010, 307 s. ISBN 978-87-993154-0-6. This is the mandatory text, marked further as [MG].\nAHO, A. V., LAM, M. S., SETHI, R., ULLMAN, J. D. Compilers: Principles, Techniques, and Tools. 2. vyd. Cloth: Prentice Hall, 2006, 1000 s. ISBN 03 21-48681-1, marked further as [ASU].",
        "annotation": "The course includes a survey of general features of programming languages and explanation of fundamental methods of their implementation. Design and program implementation of individual parts of a compiler are founded with fundamental theory of grammars and automatons. To illustrate the methods, a simple programming language is introduced and its compiler is designed and implemented. Next, fundamental methods of data types implementation, subprograms and data abstraction implementation are taught.\nKnowledge: The student knows the basics of formal languages theory and can distinguish among various ways of their formal representation. They work fluently with regular expressions and grammars, finite and pushdown automatons and context-free grammars. Within these they can implement fundamental ways of mutual conversions and canonisations.\nSkills: Using standard development tools, the student je is able to program lexical and syntactic analyser, include semantic rules to grammars and generate output code in accordance with goal specification.\nCompetences: The student can formalize efficiently and then automatize standard types of interactions with information technology. They are able to bring their outputs to the form of a goal-oriented compiler or generally interpretable language. Besides programming or scripting languages extending the possibilities of any SW products, they can automatize also processes of SW development in this way, e.g. formal modelling of user requirements or automatized verification and testing of developed program modules.",
        "guarantor": "doc. Dr. Ing. Jan Voráček, CSc. ",
        "credits": 5
    },
    {
        "detail_id": 36,
        "course_id": "500084",
        "syllabus": "seznámení s požadavky na prezentaci průběhu praxe\nvypracování prezentace průběhu praxe\nprezentace průběhu praxe",
        "literature": "",
        "annotation": "Hlavním cílem předmětu je vyhodnocení průběhu praxe, získání zpětné vazby od firem i studentů na průběh praxe a v neposlední řadě procvičení prezentačních schopností studenta. Vzhledem k tomu, že prezentace probíhá jak před akademickými pracovníky, tak i před ostatními studenty, dochází k intenzivnímu sdílení odborných i organizačních informací i osvojených odbornými dovedností studentů.\nDovednosti:\n\nStudent je schopen prezentovat klíčové aktivity řešené během praxe ve stanoveném časovém limitu\nKritické zhodnocení průběhu praxe",
        "guarantor": "Ing. Jan Jirsa",
        "credits": 2
    },
    {
        "detail_id": 37,
        "course_id": "500085",
        "syllabus": "Odborné, metodické i formální vedení studenta zvoleným vedoucím při zpracování bakalářské práce.",
        "literature": "Šablona ZP VŠPJ (PDF/DOCX), interní dokument VŠPJ\nMOLNÁR, Z., MILDEOVÁ, S., ŘEZANKOVÁ, H., BRIXÍ, R., KALINA, J. Pokročilé metody vědecké práce. Praha: Profess Consulting 2012, 170 s., ISBN 978-80-7259-064-3.",
        "annotation": "Tento předmět podporuje závěrečnou fázi zpracování diplomové práce. Jeho cílem je průběžné vedení studenta při zpracování finální textové verze diplomové práce na základě podkladů, získaných v Semináři k bakalářské práci. Výsledný dokument musí obsahově odpovídat stanoveným cílům i požadavkům vedoucího a po formální stránce splňovat požadavky, stanovené v této oblasti interními předpisy. Výuka je tvořena cvičeními, na kterých vedoucí zopakuje studentům základní principy akademického psaní, zdůrazní nejdůležitější body z aktuálních požadavků na zpracování závěrečné práce a seznámí je se standardní šablonou závěrečných prací VŠPJ. V dalších cvičeních studenti vzájemně diskutují průběžný vývoj svých dokumentů. V závěrečných hodinách proběhnou zkušební prezentace k obhajobám. Kromě společné výuky se studenti individuálně scházejí se svým vedoucím a řeší specifické odborné, metodické nebo formálních problémy.",
        "guarantor": "Ing. Lenka Kuklišová Pavelková, Ph.D.",
        "credits": 6
    },
    {
        "detail_id": 38,
        "course_id": "500086",
        "syllabus": "Úvod k technickým výpočtům, seznámení s prostředím Matlab\nMatice a operace s nimi\nDalší datové typy a operace s nimi\nPráce s textovými a dalšími soubory, ukládání a načítání dat\nŘízení toku programu\nTvorba funkcí, výpočet složitějších problémů\nVizualizace výsledků technických výpočtů a simulací\n\nReprezentace obrazu a práce s ním\nZákladní statistické výpočty\nPříklady využití toolboxů pro zpracování\nTvorba uživatelského rozhraní",
        "literature": "Zaplatílek K., Doňar B.: MATLAB pro začátečníky, Praha, 2005.\n\nZaplatílek K., Doňar B. MATLAB – začínáme se signály, 2006.\nZaplatílek K., Doňar B. MATLAB – tvorba uživatelských aplikací, 2004.\n\nAttaway, S. Matlab: A Practical Introduction to Programming and Problem Solving.",
        "annotation": "Absolvováním předmětu student získá student schopnost realizace technických výpočtů v prostředí Matlab. Student se naučí algoritmizovat technický úkol, zpracovat data různých typů, řídit program, vizualizovat výsledky výpočtů, provést základní statistickou analýzu a v neposlední řadě využít široké spektrum funkcí a toolboxů, jimiž Matlab disponuje. Získané znalosti bude student umět využít pro řešení různých úloh v dalších předmětech na VŠPJ i při realizaci vlastní výzkumné práce.",
        "guarantor": "Ing. Lucie Šaclová, Ph.D.",
        "credits": 3
    },
    {
        "detail_id": 39,
        "course_id": "500087",
        "syllabus": "Jazyk Java, verze jazyka a vývojová prostředí\nInstalace jazyka a Java Virtual Machine (JVM), Standard Development Kit (SDK), Java Development Kit (JDK)\nDatový systém jazyka, proměnné\nProgramové konstrukce jazyka – výrazy, příkazy rozhodování, konstrukce cyklu\nObjektové rozšíření jazyka – třída/object, atributy, metody\nDědičnost a rozhraní (interface)\nPráce s textem\nXML, zpracování dat\nSystémové a souborové operace – datum a čas, práce se soubory, souborové proudy, souborové operace\nJazyková lokalizace, národní prostředí systému (měna)\nPole a datové kolekce jazyka\nGrafické uživatelské rozhraní, komponenty\nSestavení programu, verzování, makefile, prostředí příkazové řádky\nŘešení reálných aplikací, příklady\nSrovnání s jinými programovacími jazyky\nZajímavosti ze světa Javy",
        "literature": "Studijní opora v LMS Moodle (povinná)\nHEROUT, Pavel \tJava a XML. České Budějovice: Kopp, 2007. ISBN 978-80-7232-307-4. (povinná)\nHEROUT, Pavel \tUčebnice jazyka Java. 5., rozš. vyd. České Budějovice: Kopp, 2010. ISBN 978-80-7232-398-2. (povinná)\nROY, Uttam K \tAdvanced Java Programming. 1. vyd. India: Oxford Unviersity Press, 2015, ISBN 978-0-19-945550-8. (doporučená)\nHEROUT, Pavel \tJava: grafické uživatelské prostředí a čeština. 2. vyd. České Budějovice: Kopp, 2007. ISBN 8072323288. (doporučená)\nHEROUT, Pavel \tXSLT 2.0 a SVG prakticky. České Budějovice: Kopp, 2010. ISBN 978-80-7232-406-4. (doporučená)",
        "annotation": "V rámci předmětu se studenti seznámí s programovacím jazykem Java, s verzemi jazyka a s vhodností jejich využití. Naučí se vytvářet aplikace v tomto jazyku, a to s využitím vhodného vývojového prostředí (Eclipse, NetBeans). Osvojí si programové konstrukce jazyka, principy vývoje a získají přehled o možnostech vytváření java-aplikací. Dále se naučí vyvíjet aplikace s grafickým uživatelským rozhraním s plným využitím principů objektově-orientovaného programování, dokážou využít vhodné komponenty dostupné v knihovnách jazyka.",
        "guarantor": "Ing. Marek Musil",
        "credits": 4
    },
    {
        "detail_id": 40,
        "course_id": "500088",
        "syllabus": "Knihovna jQuery – možnosti zavádění, seznámení s možností knihovny, utility\nKnihovna jQuery – spuštění kódu jakmile je DOM připraven, užitečné utility\njQuery UI – možnosti, použití\nAjax – syntaxe jazyka, řídící struktury, typy, funkce, objekty, propojení s HTML, události, objektový model prohlížečů, DOM, komunikace se serverem, ladění skriptů\njQuery a AJAX\nŠablonovací systémy – Architektura MVC, výhody a nevýhody\nVyužití frameworků při tvorbě aplikační logiky webových aplikací\nPoužívané frameworky pro objektově-relační mapování\nFramework Bootstap, MySQLi, PDO\nVyužití  frameworků při tvorbě aplikační logiky webových aplikací\nNávrhové vzory pro webové aplikace\nNávrhové vzory pro webové aplikace\nMapování objektového modelu na relační databáze (Objektově-relační mapování – ORM, doctrine, composer \nPoužívané frameworky pro objektově-relační mapování\nFramework Symfony",
        "literature": "Studijní opora v LMS Moodle\nLACKO, Ľ.\tAjax hotová řešení. 1. vyd. Brno : Computer Press, 2008. 269 s. ISBN 978-80-251-2108-5\nLAVIN, P.\tPHP - objektově orientované: koncepty, techniky a kód. 1. vyd. Praha: Grada, 2009. 211 s. ISBN 978-80-247-2137-8\nSCHLOSSNAGLE, G.\tPokročilé programování v PHP 5. 1. vyd. Brno: Zoner Press, 2004. 640 s. ISBN 80-86815-14-5\nSHARKIE, C. a A. FISHER.\tResponzivní webdesign: okamžitě. Brno: Computer Press, 2015. ISBN 978-802-5143-841\nNOVOTNÝ, M.\tŠablonovací systémy a MVC architektura ve webových aplikacích: bakalářská práce. Jihlava: Vysoká škola polytechnická Jihlava, 2012",
        "annotation": "Cílem předmětu je seznámit studenta s pokročilými technikami tvorby webových stránek a webových aplikací. Jedná se především o pochopení konceptu tří základních vrstev webových systémů a alespoň stručnou znalost technologií vhodných pro jejich realizaci. Dalším cílem je schopnost studenta používat v plné míře moderní technologie pro zajištění plnohodnotné interaktivity a uživatelského komfortu grafického rozhraní systémů, snadnou rozšiřitelnost a bezpečnost jejich aplikační logiky, a v neposlední řadě pro pochopení a realizaci problémově orientovaného přístupu k datům. Znalosti: Student umí vytvářet komplexní interaktivní WWW aplikace, založené na technologii AJAX. Pro aplikační logiku umí student používat návrhové vzory s důrazem na transparentní logiku modelu a její variace. Další znalostí je pak mapování objektového doménového modelu na relační a jiné databáze. Dále student umí realizovat všechny výše popsané principy například v programovacím jazyce PHP s využitím knihoven vybraných frameworků. Dovednosti: Student umí vybrat vhodný framework pro řešení problému tvorby webové aplikace. Rozumí architektuře MVC (Vrstva Model, Vrstva View, Vrstva Controller) a dovede tuto technologii použít. Obecné způsobilosti: Student se orientuje v současných trendech vytváření webových aplikací a dovede vybrat vhodnou technologii pro tvorbu webové aplikace.",
        "guarantor": "PaedDr. František Smrčka, Ph.D. ",
        "credits": 4
    },
    {
        "detail_id": 41,
        "course_id": "500089",
        "syllabus": "Zaškolení do použitých technologií a nástrojů\nAbsolvování povinných školení v organizaci\nPříprava pro absolvování Odborné praxe",
        "literature": "",
        "annotation": "Cílem přípravy na praxi je příprava a zaškolení studenta ve všech oblastech, které jsou nezbytné pro zdárné absolvování předmětu Odborná praxe ve zvolené organizaci. Během předmětu se student seznamuje s problematikou, kterou bude řešit během Odborné praxe, absolvuje potřebná školení a provádí individuální přípravné úkony dle dispozic poskytovatelů praxí.",
        "guarantor": "Ing. Jan Jirsa",
        "credits": 2
    },
    {
        "detail_id": 42,
        "course_id": "500090",
        "syllabus": "Logický návrh databáze v relačním prostředí\nModelování funkcí\nIntegrace pohledů\nTransakční zpracování, paralelismus\nFunkční závislosti, normální formy relací, minimální pokrytí\nNormalizace relačního schematu\nProcedurální rozšíření SQL\nUložené funkce, triggery",
        "literature": "BUREŠ, Z. Databázové systémy 2. Studijní opora. Jihlava: VŠP Jihlava, 2014. ISBN 978-80-87035-89-4.\nBUREŠ, Z. Databázové systémy 2. Sebrané přednášky.\nVALENTA, M. Databázové systémy [online]. Praha: ČVUT, 2010. Dostupné z: https://edux.fit.cvut.cz/oppa/BI-DBS\nVALENTA, M. Jazyk SQL [online]. Praha: ČVUT, 2010. Dostupné z: https://edux.fit.cvut.cz/oppa/BI-SQL\nPOKORNÝ, J. - VALENTA, M. Pokročilé databázové systémy [online]. Praha: ČVUT, 2010. Dostupné z: https://edux.fit.cvut.cz/oppa/MI-PDB\nPostgreSQL Documentation [online]. [cit. 2021-02-18]. Dostupné z: https://www.postgresql.org/docs/\nGARCIA-MOLINA, H. ULLMAN, D.J., WIDOM, J. Database systems: the complete book. 2. vyd. New Jersey: Pearson Prentice Hall, 2008. ISBN 0-13-187325-3.",
        "annotation": "Předmět probírá pokročilejší poznatky z databázových systémů. Studenti budou seznámeni s procedurálním rozšířením jazyka SQL, naučí se programovat uložené procedury a funkce a používat triggery. Součástí předmětu je vytvoření databáze, vypracování průvodní dokumentace a vytvoření relevantní funkcionality nad databází dle zadaných požadavků.  \nZnalosti: Student zná teorii a principy týkající se datového a funkčního modelování včetně funkčních závislostí a jejich pokrytí, normálních forem a normalizace. Zná teoretická východiska transakčního zpracování a procedurálního rozšíření SQL.  \nDovednosti: Student umí navrhnout datový a funkční model databáze, navrhnout a normalizovat relační schéma. Student umí používat transakce, rozšířit databázi o uložené procedury a triggery, ošetřit netriviální integritní omezení a provádět komplikovanější manipulace s daty.",
        "guarantor": "doc. Ing. Zbyněk Bureš, Ph.D. ",
        "credits": 4
    },
    {
        "detail_id": 43,
        "course_id": "500092",
        "syllabus": "Úvod do programu Sketchup\nModifikační nástroje programu Sketchup\nMateriálová knihovna, render, hotové modely\nTvorba jednoduchého domu\nProjekt vlastní pokoj\n3DS Studio Max – Úvod, prostředí, objekty\n3DS Studio Max – Editable poly\n3DS Studio Max – Redner a materiálová knihovna\n3DS Studio Max – Animace automatická/manuální\n3DS Studio Max – Světla a kamery\n3DS Studio Max – Fyzika\n3DS Studio Max – Částicové systémy\n3DS Studio Max – Track View Editor – pokročilá animace\nProjekt – animace dle předem schváleného tématu",
        "literature": "HUDEC, B., FELKEL, P.: Základy počítačové grafiky, ČVUT, Praha, 2007.\nJiří ŽÁRA, Bedřich BENEŠ, Jiří SOCHOR, Petr FELKEL.: Moderní počítačová grafika, Computer Press, 2005, ISBN 80-251-0454-0.\n\nJan HODICKÝ.: Programování úloh počítačové grafiky, Univerzita obrany, 2008, ISBN 9788072314973 \nhttps://x3dgraphics.com/slidesets/index.php\nhttps://www.itnetwork.cz/grafika/\nhttps://www.autodesk.com/products/3ds-max/overview\nhttps://sketchup.cz/",
        "annotation": "Cílem předmětu je podat základní teoretické a praktické poznatky týkající se zobrazování grafických informací ve 2D a 3D a také vysvětlit základní principy tvorby aplikací virtuální reality.\nZnalosti: Student zná teorii zobrazovacího řetězce, modelování elementárních a komplexních grafických prvků. Zná způsoby řešení viditelnosti ve scéně. Student zná postup pro tvorbu 3D scény včetně její vizualizace.\nDovednosti: Student umí použít teoretické poznatky pro modelování elementárních i komplexních grafických prvků ve scéně. Student umí provést návrh a realizaci 3D modelu a umí realizovat aplikace ve virtuálním prostředí s využitím stávajících standardů. Student je schopen realizovat základní animace v prezentační vrstvě simulačního SW.",
        "guarantor": "Mgr. Bc. Petr Jelínek",
        "credits": 4
    },
    {
        "detail_id": 44,
        "course_id": "500093",
        "syllabus": "Principy a techniky eXtrémního Programování\nVývojová prostředí jazyka, nástroje pro vývoj aplikací - ladění, testování\nPokročilá práce s IDE, pracovní prostředí\nPřístupy objektového modelování\nDynamické programování\nVrstvy aplikace, moduly, knihovny - rozhraní knihoven, programování proti rozhraní\nPokročilé (složité) datové struktury, implementace, inicializace a využití\nDatové kolekce programovacích jazyků (Python, Java, C#, C++)\nHromadné zpracování dat - metodika, postupy, ošetření chyb, logování, XML\nVýjimky (Exceptions), mechanismus vyjímek a jejich praktické využití\nDokumentace kódu, dokumentační komentáře\nRefaktoring a generování kódu, čistý kód\nLadění aplikace, krokování, ladící výstupy\nTestování jednotek, testy řízený vývoj, druhy testů\nIntegrační testy, kontinuální integrace\nTestování UI, vývoj aplikace s GUI\nNávrhové vzory (Design Patterns)\nProgramování v páru",
        "literature": "BECK, Kent. Extrémní programování. Praha: Grada, 2002. Moderní programování. ISBN 80-247-0300-9. (povinná)\nBECK, Kent. Programování řízené testy. Praha: Grada, 2004. Moderní programování. ISBN 80-247-0901-5. (povinná)\nBECK, K. Extreme programming eXplained: embrace change. Reading, MA: Addison-Wesley, 2000, 190 p. ISBN 02-016-1641-6. (povinná)\nROY, Uttam K. Advanced Java Programming. 1. vyd. India: Oxford Unviersity Press, 2015, ISBN 978-0-19-945550-8. (doporučená)\nHEROUT, Pavel Testování pro programátory. České Budějovice: Kopp, 2016. ISBN 978-80-7232-481-1. (doporučená)\nSTEPHENS, Matt a Doug ROSENBERG. Testování softwaru řízené návrhem. Brno: Computer Press, 2011. ISBN 978-80-251-3607-2. (doporučená)\nHEROUT, Pavel \tJava a XML. České Budějovice: Kopp, 2007. ISBN 978-80-7232-307-4. (doporučená)",
        "annotation": "Předmět se zaměřuje na plné pochopení role programátora ve vývojovém týmu. Student si především ujasní vhodné praktiky a pravidla pro maximalizaci vlastního programátorského výkonu. Od plného využití vlastností vybraného IDE přes pravidla systematické restrukturalizace kódu až k pochopení smyslu kontinuální integrace. Současně s tím budou také nastíněny techniky a postupy pro získání plné kontroly nad vyvíjenou aplikací. \nVýuková témata předmětu nejsou vázána na konkrétní programovací jazyk. Především na cvičení jsou řešeny praktické problémy implementované napříč spektrem používaných programovacích jazyků (např. Java, Python, C#, C++). Cvičení předmětu jsou koncipována jako týmová práce a diskuze nad řešením mezi jednotlivými týmy.",
        "guarantor": "Ing. Marek Musil",
        "credits": 4
    },
    {
        "detail_id": 45,
        "course_id": "500094",
        "syllabus": "Umělá inteligence – definice, historie a rozdělení oboru, základní pojmy.\nInteligentní agenti.\nŘešení problémů prohledáváním stavového prostoru.\nProhledávání v komplexním prostředí.\nSoupeřivé prohledávání a hry.\nLogický agent, výroková a predikátová logika.\nAutomatizované plánování.\nÚlohy rozhodování.\nStrojové učení.\nHluboké učení, neuronové sítě.\nPosilované učení.\nZpracování přirozené řeči.\nPočítačové vidění.\nRobotika.",
        "literature": "Studijní opora v Moodle (povinná)\nRUSSELL, S. J., NORVIG, P. Artificial Intelligence: A Modern Approach. 4. vyd. Pearson, 2021 (AIAMA-4).\nPOOLE, D.,L., MACKWORTH, A.K. Artificial Intelligence: Foundations of Computational Agents, 3rd Edition, 2023 (AIFCA). Dostupné online: https://artint.info/3e/html/ArtInt3e.html",
        "annotation": "Cíle předmětu: Student se seznámí s možnostmi vyžití nástrojů a technik umělé inteligence pro řešení reálných problémů. Tyto znalosti a dovednosti dokáže využít pro podporu plánování, řízení a rozhodování, především v oblastech technických, společenských a přírodních věd. Rozliší přímo algoritmizovatelné úlohy od výpočetně složitých,  která k časově schůdnému nalezení výsledku potřebují doplňující informace (heuristiky, užitkové funkce apod.).\nOdborné znalosti: Student zná základní způsoby neinformovaného a informovaného prohledávání stavového prostoru, dokáže různým způsobem reprezentovat určité i neurčité znalosti a na jejich základě umí odvozovat a validovat nové znalosti. Osvojí si problematiku strojového učení na lineárních i nelineárních strukturách (stromy, neuronové sítě). \nDovednosti: Student se orientuje v trendech umělé inteligence a je schopen tyto znalosti i prakticky využít. Umí formulovat aplikovatelné heuristiky a kriteriální funkce. Pracuje s obecným konceptem inteligentního agenta a umí ho přizpůsobit konkrétnímu zadání. Uvědomuje si význam kvality a dostatečnosti vstupních dat. Správně interpretuje dosažené výsledky a zohledňuje jejich omezení.",
        "guarantor": "Ing. Lenka Kuklišová Pavelková, Ph.D.",
        "credits": 4
    },
    {
        "detail_id": 46,
        "course_id": "500095",
        "syllabus": "Artificial intelligence – definition, history, areas and terminology.\nSolving problems by state space searching.\nKnowledge, its elicitation and representation (logic, frames, rules).\nExpert/knowledge-based systems.\nAlternative ways of uncertainty processing, Bayesian approach.\nMachine learning: structural representation and parametrisation. Supervised and unsupervised learning. Interpretation of learning outcomes.\nData mining: principles and applications.\nIntroduction into soft-computing (non-derivative optimization methods, neural networks, and fuzzy logic).\nFundamentals of computer speech and image processing.",
        "literature": "RUSSELL, S. J., NORVIG, P. Artificial Intelligence: A Modern Approach. 3. vyd. Pearson, 2009, 1152 s. ISBN 978-0136042594. This is the mandatory text, marked further as [AIAMA]. Available in VŠPJ library.\nWeekly updated lecture notes and related references, further marked as [LN].\nPOOLE, D.,L., MACKWORTH, A.K. Artificial Intelligence: Foundations of Computational Agents,2nd Edition, 2017, further marked as [AIFCA].",
        "annotation": "The goal of the course is to familiarise students with the possibilities of applying artificial intelligence instruments and techniques in real-life problem solving. The student is able to use the knowledge and skills to support planning, managing and decision-making especially in the area of technical, social and natural sciences. They can distinguish directly algorithmized tasks from computationally complex, typically NP-complete tasks, which need supplementary information to find results in a feasible time (heuristics, utility functions etc.)\nKnowledge: The student knows fundamental methods of uninformed and informed state space search, they can represent both definite and indefinite knowledge in various ways and on its basis they can derive and validate new knowledge. They comprehend the issue of machine learning on both linear and nonlinear structures (trees, neural networks). They can find sub-optimal solution of NP-complete problems in a finite time. They can solve application tasks by means of fuzzy logic.\nSkills: The student understands artificial intelligence trends and can use this knowledge in practice. They can formulate applicable heuristics and criterial functions. They work with the general concept of the intelligent agent and they can adjust it to a particular assignment. They realize the significance of input data quality and sufficiency. They interpret achieved results correctly and consider their limitations.",
        "guarantor": "Ing. Lenka Kuklišová Pavelková, Ph.D.",
        "credits": 4
    },
    {
        "detail_id": 47,
        "course_id": "500098",
        "syllabus": "Presenting your company, describing an ICT position\nPresent tenses revision\nPlanning a career in ICT\nExpressing future\nDescribing computer systems\nPassive voice revision\nReporting; describing a past event or development\nPast tenses revision\nApplying for a job, job interview\nPresent Perfect tenses\nBusiness correspondence\nModals; instructions; polite requests",
        "literature": "Studijní opora \"Navazující odborná angličtina pro informatiky\" v LMS Moodle\nMURPHY, Raymond. Essential grammar in use: a self-study reference and practice book for elementary learners of English. Fourth edition. Cambridge: Cambridge University Press, 2015. ISBN 978-1-107-48055-1.\nA Dictionary of Computer Science. 7th Revised Edition. Oxford: OUP, 2016. ISBN 0199688974.\nHYNEK, Jiří; VÍTKOVSKÝ, Radmil. Anglicko-český a česko-anglický slovník výpočetní techniky a informačních technologií = English-Czech Czech-English dictionary of computer science and information technology. 1. vyd. Plzeň: Fraus, 2000. 518 s. Speciál. Knihovna oborových slovníků. ISBN 80-7238-070-2.\nLITTLE, David; DAM, Leni; LEGENHAUSEN, Lienhard. Language learner autonomy: theory, practice and research. Blue Ridge Summit, PA: Multilingual Matters, 2017. ISBN 9781783098613.",
        "annotation": "Cíl: Cílem předmětu je zvládnutí odborného jazyka a prohloubení znalostí a dovedností z oblasti obecného jazyka. Dalším cílem je zvýšení autonomie studentů, lepší porozumění jejich vlastním jazykovým potřebám spojeným s profesní praxí a plánování individuálních studijních aktivit k jejich uspokojení jak v rámci předmětu, tak v praxi. Cvičení jsou aplikačně orientována na praktické užití nabytých odborných znalostí, rozvoj všech jazykových dovedností a práci s autentickými a odbornými cizojazyčnými materiály a zdroji. Znalosti: Student se orientuje v gramatických strukturách na úrovni B1/B2. Student zná a umí použít odbornou terminologii, umí definovat a vysvětlit odborné termíny svého oboru. Student zná zásady používání obecného a odborného jazyka v běžných profesních situacích, jako např. komunikace na pracovišti, emailová komunikace, profesní prezentace. Student analyzuje a zná své vlastní potřeby dalšího vzdělávání v odborném anglickém jazyce. Dovednosti: Student rozumí odbornému materiálu a orientuje se v něm. Je schopen vyhledat informace v anglicky psaném zdroji, třídit je, analyzovat, reinterpretovat, citovat a prezentovat je. Gramatické znalosti umí student aplikovat v mluveném i písemném odborném projevu. Dokáže používat obecný i odborný jazyk v běžných profesních situacích.Obecné způsobilosti: Student se umí orientovat v odborné cizojazyčné literatuře a jiných zdrojích, umí zdroje citovat a veřejně prezentovat výsledky své práce. Je schopen autonomně vyhodnotit své potřeby dalšího jazykového vzdělání v profesní oblasti, naplánovat a implementovat aktivity k jejich naplnění a vyhodnotit svůj pokrok.",
        "guarantor": "Mgr. Zdeňka Dostálová ",
        "credits": 2
    },
    {
        "detail_id": 48,
        "course_id": "500099",
        "syllabus": "Právní úprava podnikání\nMajetková struktura podniku\nKapitálová výstavba podniku\nFinanční výsledek hospodářské činnosti podniku\nPeněžní toky, využití CF ve finančním řízení podniku\nPodnikatelské plány\nZakladatelské rozpočty\nFinancování podniku\nEkonomická efektivnost investic",
        "literature": "LÍZALOVÁ, L., KOZÁKOVÁ, P. Cvičebnice ekonomiky podniku Jihlava: VSPJ, 2020\nSYNEK, M. Podniková ekonomika. 6. přepracované a doplněné vydání. Praha: C. H. Beck, 2015. 560 s. ISBN 978-80-7400-274-8. \nSrpová, J.: Začínáme podnikat, 1. vyd. Grada Publishing, Praha 2020, ISBN 978-80-271-2253-0\nSCHOLLEOVÁ, H., KOPKÁNĚ, H., KUBÁLKOVÁ, M. Ekonomické a finanční řízení pro neekonomy: finanční analýza v řízení firmy. 1. vyd. Praha: Grada, 2008, 256 s. ISBN 978-80-247-2424-9. \nSYNEK, M., a kol., H. Manažerská ekonomika 5., aktualizované a doplněné vydání. Praha: Grada, 2011, 480 s. ISBN 978-80-247-3494-1. \nMARTINOVIČOVÁ, D. a kol. Úvod do podnikové ekonomiky. 1. vyd. Praha: Grada Publishing, 2014. 208 s. ISBN 978-80-247-5316-4. \nSRPOVÁ, J., SVOBODOVÁ, I., SKOPAL, P., ORLÍK, T. Podnikatelský plán a strategie.1. vyd., Praha: Grada, 2011, ISBN 978-80-247-4103-1",
        "annotation": "Cílem předmětu je uvést studenty do základních ekonomických pojmů, zásad a vysvětlit základní souvislosti řízení podniku.\nPřednášky poskytují teoretická východiska z oblasti právních forem podnikání, majetkové a kapitálové výstavby podniku a vymezení výsledku hospodaření podniku.\nCvičení jsou orientována na rozvoj praktických dovedností potřebných při řízení podniku s důrazem na podnikové výpočty.\nZnalosti: Student rozumí tomu, která kritéria a jakou vahou vstupují do volby právní formy pro podnikání. Student chápe bilanční princip zobrazení majetku v rozvaze. Umí definovat pojmy náklady a výnosy a dokáže rozlišovat mezi pojmy výnosy a náklady na jedné straně a příjmy a výdaje na straně druhé. Student umí vysvětlit koncept výsledku hospodaření a cash flow.\nDovednosti: Student umí vybrat a zdůvodnit vhodnou právní formu podnikání pro zvolený podnik. Umí vypočítat odpisy dlouhodobého majetku, sestavit zjednodušenou rozvahu podniku. Student dovede používat základní účetní výkazy, rozvahu a výkaz zisku a ztrát, jako zdroje informací o ekonomické a finanční výkonnosti podniku. Student je schopen sestavit základní koncept podnikatelského plánu a vyčíslit plánový výsledek hospodaření a předpokládané peněžní toky v prvních letech podnikání.\nObecné způsobilosti: Student je schopen samostatně vyhledávat informace o podnicích v příslušných rejstřících (Živnostenský rejstřík, Obchodní rejstřík a Sbírka listin) a tyto informace kriticky zhodnotit. Dovede prezentovat a obhájit výsledky své práce.",
        "guarantor": "Ing. Lenka Lízalová, Ph.D. ",
        "credits": 3
    },
    {
        "detail_id": 49,
        "course_id": "500100",
        "syllabus": "Úvod do předmětu Elektronický obchod a pojmy\nVývoj e-commerce – Vývoj elektronického obchodu\nFunkce, modely, fenomény a cesty elektronického obchodu\nModely elektronického obchodování a model B2B podrobněji\nModely elektronického obchodování – B2C, C2C, B2P, B2E, B2A\nKomunikační a informační technologie, využívání internetu v elektronickém obchodování a hospodářském prostředí\nNávštěvnost elektronického obchodu\nWebdesign, zdroje příjmů elektronického obchodování\nPrameny návštěvnosti\nElektronický obchod a jeho bezpečnost\nUzavření předmětu – zopakování nejdůležitější problematiky daného předmětu",
        "literature": "VYSEKALOVÁ J.. a kolektiv \tChování zákazníka, 1.vydání, Praha: Grada Publishing a.s, 2011, ISBN 978-80-247-3528-3.\nJANOUCH, V. \tInternetový marketing, 2. vyd., Computer Press, Brno 2014, ISBN 978-80-251-4311-7\nCHAFFEY, D. \tE-business and E-commerce management, 5.vyd., Pearson, London 2011, ISBN 978-0-273-75201-1\nSEDLÁK, M., MIKULÁŠKOVÁ, P. \tJak vytvořit úspěšný a výdělečný internetový obchod, 1.vyd. , Computer Press, Brno 2012, ISBN 978-80-251-3727-7\nŘEZNÍČEK, J., PROCHÁZKA, T. \tObsahový marketing - Nakrmte Internet svým obsahem, 1.vyd. , Computer Press, Brno 2014, ISBN 978-80-251-4152-6",
        "annotation": "Cílem předmětu je seznámit studenty se základy moderní formy obchodu, tedy elektronického obchodu, s jeho podstatou a funkcemi, s jeho modely, s jeho vlastnostmi a aplikacemi, chováním spotřebitele a s prvky, které se objevují u elektronického obchodu. Přednášky jsou zaměřeny na porovnávání elektronického obchodu s kamenným obchodem, hledání rozdílů a propojení mezi těmito dvěma formami obchodů. Na cvičeních jsou procvičována jednotlivá témata na konkrétních případech i příkladech.",
        "guarantor": "Ing. Dagmar Frendlovská, Ph.D.",
        "credits": 3
    },
    {
        "detail_id": 50,
        "course_id": "500101",
        "syllabus": "• Úvod do předmětu, plán práce, základní pojmy v oblasti bezpilotních systémů a všeobecného letectví.\n\n• Legislativa provozu bezpilotních systémů, předpis ICAO Annex 2, doplňek X, předpisy a dokumenty.\n\n• Aerodynamika a mechanika letu. Pohonné jednotky. Konstrukce UAS.\n\n• GPS, telemetrie, palubní systémy. Principy navigace UAS.\n\n• Vývoj a konstrukce UAS, vyráběné a nákupní díly, sestavy. 3D model a jeho využití pro simulaci.\n\n• Simulační modely výkonových charakteristik UAS. Využití simulací při konstrukci a provozu UAS.\n\n• Systémy zvýšení bezpečnosti UAS při plnění letového úkolu. Analýza rizik provozu UAS.\n\n• Plánování a provedení letu UAS. Rozdělení vzdušného prostoru. Navigace UAV. Základy meteorologie.\n\n• Výcvik pilota UAS, metodika, předletová přípravy, simulace provozu, letový výcvik, rozbor letu.\n\n• Letové simulátory, význam pro předletovou přípravu v rámci plnění letového úkolu.\n\n• Provozní příručka UAS pro letecké práce, struktura, schvalovací proces, využití v provozu, změny.\n\n• Specifické postupy leteckých činností s UAS. Metody ověření postupů. Využití simulací. Autonomní let.",
        "literature": "CASTILLO, P., R. LOZANO a Alejandro E. DZUL. Modelling and control of mini-flying machines. New York: Springer, c2005. ISBN 1852339578.\n\nKARAS, Jakub a Tomáš TICHÝ. Drony. Brno: Computer Press, 2016. ISBN 978-80-251-4680-4.\n\nICAO Annex 2: Supplement X, ČR. In: . Praha: LIS, ŘLP, 2017. Dostupné také z: http://lis.rlp.cz/predpisy/predpisy/index.htm\n\nAUSTIN, Reg. Unmanned Aircraft Systems: UAVS Design, Development and Deployment. John & Wiley Sons, Ltd, 2010. ISBN 978-0-470-05819-0.\nKARAS, Jakub. 222 tipů a triků pro drony. Brno: Computer Press, 2017. ISBN 978-80-251-4874-7.\nJURAČKA, Petr Jan. Drony - fotografování z ptačí perspektivy: co všechno potřebujete vědět o dronech a jejich využití pro leteckou fotografii a video. Praha: Grada, 2017. ISBN 978-80-247-5787-2.\nHOHENLOHE, Stephan zu. Drony: stručně a přehledně: výběr vhodného modelu, ovládání, foto a video, legislativa. Frýdek-Místek: Alpress, 2016. ISBN 978-80-7543-234-6.",
        "annotation": "Cílem předmětu je získání aplikačních znalostí a dovedností konstrukce, montáže, údržby a provozu bezpilotního systému. Posluchači jsou seznámeni s fyzikálními principy letu, charakteristikou konstrukce draku, pohonné jednotky a řídicích systémů. Provozní problematika je v souladu s příslušnou legislativou provozu bezpilotních systémů ve společném vzdušném provozu. Praktická část je zaměřena na montáž, údržbu a provoz bezpilotního systému za účelem plnění definovaných úkolů. Součástí konstrukční i provozní části je také tvorba příslušných simulačních modelů pro predikování charakteristik systému při plnění konkrétních letových úloh.\nAbsolvent zná problematiku provozu bezpilotního v rozsahu potřebném pro složení teoretické zkoušky operátora bezpilotního systému na Úřadu pro civilní letectví. Je schopen sestavit provozní příručku, obsahující technické i provozní parametry a specifikace různých typů letových úloh. Umí navrhnout bezpilotní systém z hlediska výkonových charakteristik a z dostupných vyráběných, nebo nákupních komponent. Zná simulační modely pro optimalizace konstrukce bezpilotního systému a pro plánování specifických letových úloh.\nAbsolvent je schopný provádět běžnou i nadstandardní údržbu bezpilotního systému. Připraví systém k letu, v průběhu letu jej řídí v rámci plnění zadaného úkolu. Dokáže programovat řídící jednotku systému a provádět jeho modifikace pro plnění specifických úloh. Provede vyhodnocení dat, získaných plněním letového úkolu.",
        "guarantor": "Ing. Bc. Karel Dvořák, Ph.D.",
        "credits": 4
    },
    {
        "detail_id": 51,
        "course_id": "500102",
        "syllabus": "Gigabitový ethernet, jednovidová a vícevidová optická vlákna\nIPv6\nVLAN\nŘízení pásma v LAN a WAN\nRodina Windows server, historie\nJmenné a adresářové služby - LDAP, AD\nMicrosoft Windows server\nSouborové služby a terminálové služby\nInternet information services\nBezpečnost sítí – zabezpečení komunikace, VPN\nVirtualizace, clustery, cloud computing\nIP telefonie – protokoly H.323 a SIP",
        "literature": "SOSINSKY, B. Mistrovství – počítačové sítě. 1. vyd. Brno: Computer Press, 2010, 840 s. ISBN 978-80-251-3363-7.\nRUEST, D., RUEST, N. Virtualizace: podrobný průvodce. 1. vyd. Brno: Computer Press, 2010, 408 s. ISBN 978-80-251-2676-9.\nPALMER, M. Hands-On Microsoft Windows Server 2016. 2nd edition. Cengage Learning, USA. 2017. ISBN 978-1-305-07862-8.\nKRAUSE, J. Mastering Windows Server 2016. 1st release. Packt Publishing Ltd. UK. ISBN 978-1-78588-890-8.",
        "annotation": "Tento předmět zaměřen na výklad pokročilejších technologií počítačových sítí. Po úvodu do gigabitového ethernetu, optických sítí, VLAN a IPv6 protokolu se studenti seznámí s řízením pásma v LAN a WAN sítích, virtualizací, VoIP a zabezpečení komunikace. Druhá část předmětu je věnována technologiím Microsoft Windows Server, studenti se seznámí se základy adresářových služeb, technologií pro vzdálený přístup (RDP) a IIS (web server). Znalosti: Student se orientuje v moderních počítačových sítích postavených na gigabitovém metalickém a optickém ethernetu s využitím VLAN, protokolu IPv6. Student umí bezpečně využívat základní služby MS Windows Server. Student zná protokoly IP telefonie, detailně se orientuje ve virtualizačních technologiích a zabezpečení komunikace pomocí VPN.Dovednosti: Student umí konfigurovat gigabitovou síť na IPv6 s podporou VLAN, zná desktopové virtualizační nástroje, je schopen nainstalovat a nakonfigurovat Windows server 2016 a služby Active Directory, souborové služby, terminálové služby (remote desktop services), Web serveru (IIS) a VPN.Obecné způsobilosti: Student zná a umí využívat pokročilé prostředky počítačových sítí, je schopen instalovat, konfigurovat a administrovat tyto sítě.",
        "guarantor": "Mgr. Antonín Přibyl ",
        "credits": 4
    },
    {
        "detail_id": 52,
        "course_id": "500103",
        "syllabus": "Bezeztrátové a ztrátové kompresní algoritmy\nZáklady počítačové grafiky (vektorová a rastrová grafika, 3D)\nReprezentace signálu v časové a kmitočtové oblasti\nDigitální fotografie – záznam, zpracování, formáty, komprese\nDigitální audio – záznam, zpracování, formáty, komprese\nDigitální video – záznam, zpracování, formáty, komprese\nStreamování audia a videa",
        "literature": "BUREŠ, Z. Multimédia. Sebrané přednášky.\nStudijní opora v LMS Moodle\nBERKA, R. a kol. Multimédia I. Praha: ČVUT, 2010. 178 s. ISBN 978-80-01-05859-6.\nBURIÁNEK, J. Multimediální a grafické aplikace [online]. Praha: ČVUT, 2010. Dostupné z: https://edux.fit.cvut.cz/oppa/BI-MGA\nHOLUB, J. Komprese dat [online]. Praha: ČVUT, 2010. Dostupné z: https://edux.fit.cvut.cz/oppa/MI-KOD",
        "annotation": "Předmět probírá základní aspekty záznamu, zpracování a produkce multimediálních signálů, zejména se zřetelem k tvorbě webových a multimediálních prezentací. \nZnalosti: Student zná principy záznamu a zpracování audio a video signálu a grafických objektů. Zná metody ztrátové a bezeztrátové datové komprese, zejména ve vztahu k multimediálním signálům. \nDovednosti: Student umí používat odpovídající prostředky pro pořízení, záznam, zpracování, kompresi a publikování grafiky, audio a video signálu.",
        "guarantor": "Mgr. Antonín Přibyl ",
        "credits": 4
    },
    {
        "detail_id": 53,
        "course_id": "500104",
        "syllabus": "Komunikační proces, komunikace verbální, neverbální, paraverbální\nKladení otázek, aktivní naslouchání\nZpětná vazba, kritika, pochvala\nAsertivita\nŘečnické triky\nTým, týmové role, komunikace v týmu\nRétorika, druhy řečnických projevů\nStrach z vystupování, zvládání trémy, zdravé sebevědomí\nPřesvědčivý projev, motivace\nPrezentační dovednosti, vystupování s mikrofonem a před kamerou\nProdejní dovednosti\nEtika, etiketa, etické kodexy\nFiremní kultura\nInterkulturní rozdíly v komunikaci",
        "literature": "Povinná literatura:\nStudijní opora v LMS Moodle \nHRKAL, M. Odprezentuj: Průvodce přípravou prezentace. Praha, Bizbooks, 2018. ISBN: 978-80-265-0810-6. \nLOŠŤÁKOVÁ, O., LOJA, R. Empatická a asertivní komunikace. Praha, Grada, 2020. ISBN 978-80-271-2227-1. \nNEVOLOVÁ, M. Přestaň prezentovat, začni vyprávět. Praha, Grada, 2017. ISBN 978-80-247-5664-6 .\nŠIROKÝ, J. Psaní a prezentace odborných textů. Praha, Leges, 2019. ISBN 978-80-7502-340-7.\nDoporučená literatura:\nGOLZARI, A. It’s Called Presenting, Not Talking Out Loud: A Quick, Strategic Guide for Effective Presentations. London, AVALON GUIDEBOOKS, 2010. \nTHEOBALD, T. Zlepšete své prezentační dovednosti: Jak srozumitelně, inspirativně a sebevědomě prezentovat. Praha, Lingea, 2020. \nZAHARIADES, D. Jak být asertivní a říkat ne za každé situace. Praha, Grada, 2021.",
        "annotation": "Cílem předmětu je rozvoj verbálních schopností studentů a kultury jejich veřejného projevu. Studenti získají v rovině teoretické základní informace nezbytné k účinné komunikaci a přesvědčivému veřejnému vystupování z teorie komunikace, psychologie a pravidel společenského chování. Výuka je orientována aplikačně na rozvoj schopností vhodně komunikovat s ohledem na aktuální situaci, vystupovat před publikem, prezentovat a zvládat trému. Znalosti: Student umí vysvětlit základní pojmy z teorie komunikace a chápe jejich souvislosti. Je si vědom, jak je komunikační proces ovlivňován kulturním prostředím a jeho účastníky. Student zná základní pravidla vystupování na veřejnosti, prezentování, zvládání trémy a společenského chování. Dovednosti: Student dovede vhodně komunikovat s ohledem na danou situaci a účastníky komunikačního procesu. Student je schopen rozpoznat manipulativní komunikační metody a techniky a adekvátně na ně zareagovat. Student je schopen podat v daném časovém limitu a před publikem přesvědčivý a smysluplný řečnický výkon na odborné téma. Obecné způsobilosti: Prostřednictvím zdravé a funkční komunikace student rozvíjí svoji osobnost a vytváří síť sociálních vztahů. Student umí využívat techniku (např. mikrofon) potřebnou pro vystupování na veřejnosti a při sledování projevu jiných řečníků dokáže rozpoznat případnou manipulaci.",
        "guarantor": "Mgr. Martina Černá, Ph.D. ",
        "credits": 2
    },
    {
        "detail_id": 54,
        "course_id": "500299",
        "syllabus": "Úvod do číslicových systémů, kombinační a sekvenční logické obvody, ALU.\nZáklady mikroprocesorové techniky. Struktura programu pro mikrokontrolery ATmega328P\nZáklady programování C++ (Wiring). Programování v prostředi UnoArduSim / IDE Arduino\nPLC a průmyslové sběrnice.\nArchitektura počítače, struktura, podsystémy. Reprezentace dat v počítači.\nČásti počítače, procesor, základní deska, sběrnice, zřetězené vykonávání instrukcí.\nVstupní a výstupní podsystém počítače.\nKonstrukce vstupních a výstupních zařízení, periferie, zobrazovací jednotky\nDatová uložiště a systémy RAID, záložní zdroje.",
        "literature": "BÍLEK, Michal. Architektura počítačů. Https://moodle.vspj.cz [online]. Jihlava: VŠPJ, 2023, 1.3.2023 [cit. 2023-03-01]. Dostupné z: https://moodle.vspj.cz/course/view.php?id=202547#section-5\nANTOŠOVÁ, Marcela a Vratislav DAVÍDEK. Číslicová technika. Páté aktualizované vydání. České Budějovice: Kopp, 2018. ISBN isbn:978-80-7232-509-2.\nDONZELLINI, Giuliano. Deeds Learning Materials. Digital Electronics Deeds [online]. Italy: University of Genoa, 2020, 23.1.2020 [cit. 2020-01-23]. Dostupné z: https://www.digitalelectronicsdeeds.com/learningmaterials/labtopics.html\nMESSMER, H., DEMBOWSKI, K. Velká kniha hardware: architektura, funkce, programování. 1. vyd. Brno: CP Books, 2005, 1224 s. ISBN 80-251-0416-8. \nPINKER, J. Mikroprocesory a mikropočítače. 1. vyd. Praha: BEN technická literatura, 2008, 159 s. ISBN 978-80-7300-110-0. \nDEMBOWSKI, K. Mistrovství v hardware. 1. vyd. Brno: Computer Press, 2009. 712 s. ISBN 978-80-251-2310-2. \nVODA, Zbyšek. Průvodce světem Arduina. Vydání druhé. Bučovice: Martin Stříž, 2017. ISBN 978-80-87106-93-8.\nArduino: Home [online]. Global: Arduino, 2021 [cit. 2021-02-17]. Dostupné z: https://www.arduino.cc/\nDŘÍNEK, Milan. Přehled a stručná charakteristika vybraných průmyslových sběrnic. Vyvoj.hw.cz [online]. Praha: HW server, 2004, 3.3.2004 [cit. 2022-09-16]. Dostupné z: https://vyvoj.hw.cz/teorie-a-praxe/dokumentace/prehled-a-strucna-charakteristika-vybranych-prumyslovych-sbernic.html",
        "annotation": "Cílem předmětu je seznámit studenty nejprve se základy číslicové a mikroprocesorové techniky a následně s architekturou počítače, jeho komponentami a periferiemi. Uvádí též základy architektury PLC, mikrokontrolérů a průmyslových sběrnic.Znalosti: Student zná základy číslicové a mikroprocesorové techniky. Student zná architekturu počítače, jeho základní komponenty, periferie a principy jejich funkce. Zná základní vlastnosti mikrokontrolerů a rozdíly oproti PC a zná možnosti a vlastnosti průmyslových sběrnic. Zná základní kontrukce pro programování mikrokontrolerů.Dovednosti: Navrhuje, pomocí jakého technické prostředku lze řešit zadaný úkol, a to na základě teoretických znalostí. Umí navrhovat a sestavovat osobní počítače a mikrokontrolery s ohledem k požadovanému účelu jejich použití. Umí diagnostikovat hardwarové komponenty a zařízení.",
        "guarantor": "Ing. Michal Bílek ",
        "credits": 4
    },
    {
        "detail_id": 55,
        "course_id": "500388",
        "syllabus": "Úvod ke zpracování obrazu,  využití zpracování a analýzy obrazových dat a počítačového vidění, úvod do programu Matlab\nDigitální reprezentace obrazu, spektrální reprezentace obrazových dat, základní metody úprav obrazu – bodové, lokální a globální transformace obrazu, transformace kontrastu a barev\nOdstranění šumu a zkreslení - filtrace v časové a spektrální oblasti\nDetekce a zostřování hran\nTexturní analýza\nMetody segmentace obrazu\nDalší operace pro úpravu obrazu, extrakce příznaků z obrazu, rozpoznávání objektů, klasifikace objektů\nAnalýza pohybu\nVyužití počítačového vidění v průmyslu\nVyužití zpracování obrazu v medicínských aplikacích",
        "literature": "Walek P, Lamoš M, Jan J. Analýza biomedicínských obrazů. Počítačová cvičení. VUT, FEKT, UBMI. 2013.\nJan J. Číslicová filtrace, analýza a restaurace signálů, VUTIUM Brno. 2002.\nGonzalez RC, Woods RE. Digital image processing. Fourth edition. New York: Pearson. 2018.",
        "annotation": "Předmět poskytne studentovi komplexní rozhled v oblasti zpracování obrazu a počítačového vidění, a to od jeho digitalizace, reprezentace, jednoduchých i pokročilých úprav, přes jeho filtraci, metody segmentace obrazu, texturní analýzu, příznakové metody rozpoznávání až po jeho klasifikaci a detekci objektů v obraze. Nabyté teoretické vědomosti si student vždy vyzkouší aplikovat v rámci praktických úkolů ve cvičení. Student bude schopen získané teoretické vědomosti použít při zpracování specifických obrazových dat, například z medicínských přístrojů, mikroskopů, robotů a dalších průmyslu přístrojů a také v dalším výzkumu. Praktická část výuky bude realizována v programu Matlab. Důležitým předpokladem pro úspěšné splnění předmětu jsou alespoň základní znalosti programování v prostředí Matlab.\n\nZnalosti\n\nStudent získá znalosti o principu metod zpracování obrazu a počítačovém vidění. Student bude schopen tyto metody prakticky využít pro zpracování obrazů v různých oblastech. Student bude umět navrhnout konkrétní metody vhodné pro řešení specifických úloh.\n\nDovednosti\n\nStudent získá představu o využití a existenci metod zpracování obrazu. Student se naučí realizovat vybrané metody zpracování obrazu v programu Matlab. Tyto metody bude schopen využít pro zpracování obrazů pro různé aplikace v průmyslu, medicíně, či filmovém a herním průmyslu.",
        "guarantor": "Ing. Lucie Šaclová, Ph.D.",
        "credits": 2
    },
    {
        "detail_id": 56,
        "course_id": "500389",
        "syllabus": "Úvod do strojového učení (hlavní pojmy, historie, současnost, algoritmy, typy úloh, výzvy a problémy; prakticky: lineární regrese)\n\nZákladní praktiky strojového učení (doporučený pracovní postup při řešení úloh strojového učení; prakticky: projekt strojového učení od začátku do konce)\n\nKlasifikace entit (binární a multiclass klasifikace; prakticky: rozpoznávání psaných číslic)\n\nTrénování modelů (metoda Gradient Descent; prakticky: Titanic dataset)\n\nPokročilé metody klasifikace (Support Vector Machines, Rozhodovací stromy, Random Forest; prakticky: SPAM filtr)\n\nUčení bez učitele (shlukování, redukce dimenzionality, detekce anomalit; prakticky: doporučovací systém)\n\nNeuronové sítě a Deep Learning (principy a klíčové pojmy, framework Keras; prakticky: binární a multiclass klasifikace, regrese)\n\nDeep Learning pro počítačové vidění (konvoluční neuronové sítě; prakticky: rozpoznávání objektů v obrazu, rozpoznávání obličejů)\n\nDeep Learning pro texty a sekvenční data (word embeddings, předtrénované modely; prakticky: rekurentní neuronové sítě)\n\nGenerativní Deep Learning (variační autoenkodéry, GAN, transformery; prakticky: generování textu, přenos stylu obrazů, generování obrazů)",
        "literature": "GÉRON, A., Hands-on machine learning with Scikit-Learn, Keras and TensorFlow : concepts, tools, and techniques to build intelligent systems\tBeijing\tO'Reilly, 2019, 978-1-4920-3264-9\nCHOLLET, F., Deep learning v jazyku Python : knihovny Keras, TensorFlow, Praha, Grada Publishing, 2019, 978-80-247-3100-1\nCOELHO, L P. -- RICHERT, W., Building machine learning systems with Python, Birmingham, Packt Publishing, 2013, 978-1-78216-140-0",
        "annotation": "Cílem předmětu je seznámit studenty s aktuálním stavem poznání ve vybraných oblastech strojového učení a představit jim algoritmy a jejich praktické aplikace v dostupných nástrojích. Praktické aplikace jsou zaměřeny na úlohy jako je například rozpoznávání psaného textu, analýza sentimentu textu, predikce cen nemovitostí, předpověď teploty z časové řady meteo údajů, prediktivní psaní textu, rozpoznávání objektů v obrazu nebo generativní textové a obrazové úlohy.",
        "guarantor": "Ing. Jan Mittner, Ph.D.",
        "credits": 2
    }
]